const { hongkongPSModel } = require('../models');
const moment = require('moment');
const log4js = require('log4js');
const logger = log4js.getLogger();
logger.level = 'info';

const data = {
    "draw": 1,
    "recordsTotal": 548,
    "recordsFiltered": 548,
    "data": [
      [
        "<a href=\"ica\">YMCA Christian Academy</a>",
        "私立",
        "基督教",
        "中西區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"ssnahkws\">三水同鄉會禤景榮學校</a>",
        "資助",
        "無",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"apsss\">上水宣道小學</a>",
        "資助",
        "基督教",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"waichow\">上水惠州公立學校</a>",
        "資助",
        "無",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"ltymps\">劉德容紀念小學</a>",
        "資助",
        "無",
        "屯門區",
        "70",
        "男女",
        null
      ],
      [
        "<a href=\"wynps\">世界龍岡學校黃耀南小學</a>",
        "資助",
        "無",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"cneclmc\">中華傳道會呂明才小學</a>",
        "資助",
        "基督教",
        "葵青區",
        "66",
        "男女",
        null
      ],
      [
        "<a href=\"cnectt\">許大同學校</a>",
        "資助",
        "基督教",
        "葵青區",
        "65",
        "男女",
        null
      ],
      [
        "<a href=\"hft\">中華基督教會何福堂小學</a>",
        "資助",
        "基督教",
        "屯門區",
        "70",
        "男女",
        null
      ],
      [
        "<a href=\"ckps\">中華基督教會元朗真光小學</a>",
        "資助",
        "基督教",
        "元朗區",
        "74",
        "男女",
        null
      ],
      [
        "<a href=\"chuenyuen1\">全完第一小學</a>",
        "資助",
        "基督教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"chuenyuen2\">全完第二小學</a>",
        "資助",
        "基督教",
        "葵青區",
        "65",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"heepwoh1\">協和小學</a>",
        "資助",
        "基督教",
        "油尖旺",
        "32",
        "男女",
        null
      ],
      [
        "<a href=\"heepwoh2\">中華基督教會協和小學(長沙灣)</a>",
        "資助",
        "基督教",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"cccktps\">基全小學</a>",
        "資助",
        "基督教",
        "油尖旺",
        "32",
        "男女",
        null
      ],
      [
        "<a href=\"keitsz\">中華基督教會基慈小學</a>",
        "資助",
        "基督教",
        "黃大仙",
        "45",
        "男女",
        null
      ],
      [
        "<a href=\"kws\">基慧小學</a>",
        "資助",
        "基督教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"kwmwps\">中華基督教會基慧小學(馬灣)</a>",
        "資助",
        "基督教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"kfp\">基法小學</a>",
        "資助",
        "基督教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"kfps\">基法小學油塘</a>",
        "資助",
        "基督教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"keiwan\">基灣小學</a>",
        "資助",
        "基督教",
        "東區",
        "16",
        "男女",
        null
      ],
      [
        "<a href=\"ccckeiwan\">基灣小學愛蝶灣</a>",
        "資助",
        "基督教",
        "東區",
        "16",
        "男女",
        null
      ],
      [
        "<a href=\"keichun\">基真小學</a>",
        "資助",
        "基督教",
        "葵青區",
        "65",
        "男女",
        null
      ],
      [
        "<a href=\"keiwa\">中華基督教會基華小學</a>",
        "資助",
        "基督教",
        "黃大仙",
        "45",
        "男女",
        null
      ],
      [
        "<a href=\"kwpskt\">基華小學九龍塘</a>",
        "資助",
        "基督教",
        "九龍城",
        "41",
        "男女",
        null
      ],
      [
        "<a href=\"ccctaiops\">中華基督教會大澳小學</a>",
        "資助",
        "基督教",
        "離島區",
        "98",
        "男女",
        null
      ],
      [
        "<a href=\"butsan\">中華基督教會拔臣小學</a>",
        "資助",
        "基督教",
        "屯門區",
        "71",
        "男女",
        null
      ],
      [
        "<a href=\"fyw\">中華基督教會方潤華小學</a>",
        "資助",
        "基督教",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"keito\">基道小學</a>",
        "資助",
        "基督教",
        "油尖旺",
        "31",
        "男女",
        null
      ],
      [
        "<a href=\"ktkc\">基道小學九龍城</a>",
        "資助",
        "基督教",
        "九龍城",
        "34",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"cccmwfys\">蒙黃花沃紀念小學</a>",
        "資助",
        "基督教",
        "屯門區",
        "70",
        "男女",
        null
      ],
      [
        "<a href=\"ccckkps\">長洲堂錦江小學</a>",
        "資助",
        "基督教",
        "離島區",
        "97",
        "男女",
        null
      ],
      [
        "<a href=\"cymcaps\">中華基督教青年會小學</a>",
        "資助",
        "基督教",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"cwsa\">中西區聖安多尼學校</a>",
        "資助",
        "天主教",
        "中西區",
        "11",
        "男女",
        null
      ],
      [
        "<a href=\"cmsth\">丹拿山循道學校</a>",
        "資助",
        "基督教",
        "東區",
        "14",
        "男女",
        null
      ],
      [
        "<a href=\"hnyp\">九龍城浸信會禧年(恩平)小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "88",
        "男女",
        null
      ],
      [
        "<a href=\"haynien\">九龍城浸信會禧年小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "89",
        "男女",
        null
      ],
      [
        "<a href=\"ktbwcs\">九龍塘天主教華德學校</a>",
        "資助",
        "天主教",
        "九龍城",
        "41",
        "男女",
        null
      ],
      [
        "<a href=\"ktsps\">九龍塘學校(小學部)</a>",
        "私立",
        "無",
        "九龍城",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"klntong\">九龍塘官立小學</a>",
        "官立",
        "無",
        "九龍城",
        "41",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"apskt\">九龍塘宣道小學</a>",
        "私立",
        "基督教",
        "九龍城",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"fsris\">九龍塘方方樂趣英文小學</a>",
        "私立",
        "無",
        "九龍城",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"kwwclpms\">李炳紀念學校</a>",
        "資助",
        "無",
        "油尖旺",
        "34",
        "男女",
        null
      ],
      [
        "<a href=\"kbsjb\">九龍灣聖若翰天主教小學</a>",
        "資助",
        "天主教",
        "觀塘區",
        "46",
        "男女",
        null
      ],
      [
        "<a href=\"ktlms\">九龍真光中學(小學部)</a>",
        "私立",
        "基督教",
        "九龍城",
        "0",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"krs\">九龍禮賢學校</a>",
        "私立",
        "基督教",
        "深水埗",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"eps\">九龍靈光小學</a>",
        "資助",
        "基督教",
        "九龍城",
        "34",
        "男女",
        null
      ],
      [
        "<a href=\"pylfps\">五旬節于良發小學</a>",
        "資助",
        "基督教",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"wingkwong\">五旬節聖潔會永光小學</a>",
        "資助",
        "基督教",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"pgms\">五旬節靳茂生小學</a>",
        "資助",
        "基督教",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"fdbwa\">五邑工商總會學校</a>",
        "資助",
        "無",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"fdccys\">五邑鄒振猷學校</a>",
        "資助",
        "無",
        "屯門區",
        "70",
        "男女",
        null
      ],
      [
        "<a href=\"asbury\">亞斯理衞理小學</a>",
        "資助",
        "基督教",
        "葵青區",
        "65",
        "男女",
        null
      ],
      [
        "<a href=\"yantak\">仁德天主教小學</a>",
        "資助",
        "天主教",
        "屯門區",
        "70",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"yotmlwfps\">仁愛堂劉皇發夫人小學</a>",
        "資助",
        "無",
        "屯門區",
        "71",
        "男女",
        null
      ],
      [
        "<a href=\"yottkpps\">仁愛堂田家炳小學</a>",
        "資助",
        "無",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"hosiknam\">仁濟醫院何式南小學</a>",
        "資助",
        "無",
        "屯門區",
        "71",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"lccs\">仁濟醫院羅陳楚思小學</a>",
        "資助",
        "無",
        "屯門區",
        "70",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"ychchtps\">仁濟醫院蔡衍濤小學</a>",
        "資助",
        "無",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"ychcthwps\">仁濟醫院趙曾學韞小學</a>",
        "資助",
        "無",
        "葵青區",
        "66",
        "男女",
        null
      ],
      [
        "<a href=\"ychcisps\">仁濟醫院陳耀星小學</a>",
        "資助",
        "無",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"qesosaps\">伊利沙伯中學舊生會小學</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"qesosabps\">伊利沙伯中學舊生會小學分校</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"islamps\">伊斯蘭學校</a>",
        "資助",
        "回教",
        "屯門區",
        "71",
        "男女",
        null
      ],
      [
        "<a href=\"idpmps\">伊斯蘭鮑伯濤紀念小學</a>",
        "資助",
        "回教",
        "黃大仙",
        "45",
        "男女",
        null
      ],
      [
        "<a href=\"jvsj\">佐敦谷聖若瑟天主教小學</a>",
        "資助",
        "天主教",
        "觀塘區",
        "46",
        "男女",
        null
      ],
      [
        "<a href=\"jrgps\">佐敦道官立小學</a>",
        "官立",
        "無",
        "油尖旺",
        "31",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"bcwkps\">佛教中華康山學校</a>",
        "資助",
        "佛教",
        "東區",
        "14",
        "男女",
        null
      ],
      [
        "<a href=\"chilinbps\">佛教志蓮小學</a>",
        "資助",
        "佛教",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"bckps\">佛教慈敬學校</a>",
        "資助",
        "佛教",
        "觀塘區",
        "46",
        "男女",
        null
      ],
      [
        "<a href=\"blbyms\">佛教林炳炎紀念學校</a>",
        "資助",
        "佛教",
        "葵青區",
        "65",
        "男女",
        null
      ],
      [
        "<a href=\"lkt\">佛教林金殿紀念小學</a>",
        "資助",
        "佛教",
        "葵青區",
        "65",
        "男女",
        null
      ],
      [
        "<a href=\"bwys\">佛教榮茵學校</a>",
        "資助",
        "佛教",
        "元朗區",
        "74",
        "男女",
        null
      ],
      [
        "<a href=\"bcwkms\">陳榮根紀念學校</a>",
        "資助",
        "佛教",
        "元朗區",
        "73",
        "男女",
        null
      ],
      [
        "<a href=\"bwcups\">佛教黃焯菴小學</a>",
        "資助",
        "佛教",
        "灣仔區",
        "12",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"plkcastar\">保良局世德小學</a>",
        "資助",
        "無",
        "葵青區",
        "66",
        "男女",
        null
      ],
      [
        "<a href=\"plkhsn\">保良局何壽南小學</a>",
        "資助",
        "無",
        "九龍城",
        "34",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"plkis\">保良局建造商會學校</a>",
        "私立",
        "無",
        "灣仔區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"plkheps\">保良局志豪小學</a>",
        "資助",
        "無",
        "屯門區",
        "70",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"plkfwkc\">保良局方王錦全小學</a>",
        "資助",
        "無",
        "屯門區",
        "70",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"plkcjy\">保良局朱正賢小學</a>",
        "資助",
        "無",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"plklmceps\">保良局林文燦英文小學</a>",
        "直資",
        "無",
        "九龍城",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"plklcskam\">保良局梁周順琴小學</a>",
        "資助",
        "無",
        "屯門區",
        "70",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"plkwch\">保良局王賜豪(田心谷)小學</a>",
        "資助",
        "無",
        "沙田區",
        "88",
        "男女",
        null
      ],
      [
        "<a href=\"plktkpmps\">保良局田家炳千禧小學</a>",
        "資助",
        "無",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"plktkp\">保良局田家炳小學</a>",
        "資助",
        "無",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"plkcktps\">保良局莊啟程小學</a>",
        "資助",
        "無",
        "沙田區",
        "89",
        "男女",
        null
      ],
      [
        "<a href=\"plkvktca\">保良局莊啟程第二小學</a>",
        "資助",
        "無",
        "屯門區",
        "70",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"cky\">保良局蔡繼有學校</a>",
        "私立",
        "無",
        "深水埗",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"plkshs\">保良局蕭漢森小學</a>",
        "資助",
        "無",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"plkflpy\">馮李佩瑤小學</a>",
        "資助",
        "無",
        "屯門區",
        "71",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"plkgspts\">張凝文學校</a>",
        "資助",
        "無",
        "灣仔區",
        "12",
        "男女",
        null
      ],
      [
        "<a href=\"grandmont\">保良局錦泰小學</a>",
        "資助",
        "無",
        "黃大仙",
        "45",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"plkcnc\">保良局陳南昌夫人小學</a>",
        "資助",
        "無",
        "黃大仙",
        "43",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"plkctslps\">保良局陳守仁小學</a>",
        "直資",
        "無",
        "油尖旺",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"plkcy\">保良局陳溢小學</a>",
        "資助",
        "無",
        "葵青區",
        "66",
        "男女",
        null
      ],
      [
        "<a href=\"plklht\">保良局陸慶濤小學</a>",
        "直資",
        "無",
        "西貢區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"plkrps\">保良局雨川小學</a>",
        "資助",
        "無",
        "沙田區",
        "89",
        "男女",
        null
      ],
      [
        "<a href=\"yyps\">圓玄小學</a>",
        "直資",
        "無",
        "屯門區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"plkfcmps\">保良局馮晴紀念小學</a>",
        "資助",
        "無",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"plkwws\">保良局黃永樹小學</a>",
        "資助",
        "無",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"wusichong\">伍時暢紀念學校</a>",
        "資助",
        "無",
        "屯門區",
        "70",
        "男女",
        null
      ],
      [
        "<a href=\"gt\">優才(楊殷有娣)書院</a>",
        "直資",
        "無",
        "西貢區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"ylaps\">元朗公立中學校友會小學</a>",
        "資助",
        "無",
        "元朗區",
        "73",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"alu\">英業小學</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"ylmaps\">元朗商會小學</a>",
        "資助",
        "無",
        "元朗區",
        "73",
        "男女",
        null
      ],
      [
        "<a href=\"ylgps\">元朗官立小學</a>",
        "官立",
        "無",
        "元朗區",
        "74",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"pokokbs\">元朗寶覺小學</a>",
        "資助",
        "佛教",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"hzit\">元朗朗屏邨惠州學校</a>",
        "資助",
        "無",
        "元朗區",
        "73",
        "男女",
        null
      ],
      [
        "<a href=\"tkps\">元朗朗屏邨東莞學校</a>",
        "資助",
        "無",
        "元朗區",
        "73",
        "男女",
        null
      ],
      [
        "<a href=\"kms\">光明學校</a>",
        "資助",
        "無",
        "元朗區",
        "73",
        "男女",
        null
      ],
      [
        "<a href=\"kmyls\">光明英來學校</a>",
        "資助",
        "無",
        "元朗區",
        "74",
        "男女",
        null
      ],
      [
        "<a href=\"phcps\">八鄉中心小學</a>",
        "資助",
        "無",
        "元朗區",
        "74",
        "男女",
        null
      ],
      [
        "<a href=\"oxbridge\">劍津英國學校</a>",
        "私立",
        "無",
        "九龍城",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"llsy\">勵志會梁李秀娛紀念小學</a>",
        "資助",
        "無",
        "東區",
        "16",
        "男女",
        null
      ],
      [
        "<a href=\"npgps\">北角官立小學</a>",
        "官立",
        "無",
        "東區",
        "14",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"npcvr\">北角官立小學(雲景道)</a>",
        "官立",
        "無",
        "灣仔區",
        "12",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"cmsnp\">北角循道學校</a>",
        "資助",
        "基督教",
        "東區",
        "14",
        "男女",
        null
      ],
      [
        "<a href=\"npmps\">北角衞理小學</a>",
        "資助",
        "基督教",
        "東區",
        "14",
        "男女",
        null
      ],
      [
        "<a href=\"kysps\">十八鄉鄉事委員會公益社小學</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"hyps\">協恩中學附屬小學</a>",
        "資助",
        "基督教",
        "九龍城",
        "34",
        "女校",
        null
      ],
      [
        "<a href=\"nls\">南丫北段公立小學</a>",
        "資助",
        "無",
        "離島區",
        "96",
        "男女",
        null
      ],
      [
        "<a href=\"sylgps\">南元朗官立小學</a>",
        "官立",
        "無",
        "元朗區",
        "73",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"yuenlonglsts\">梁省德學校</a>",
        "資助",
        "無",
        "元朗區",
        "73",
        "男女",
        null
      ],
      [
        "<a href=\"mcyoms\">鄭任安夫人千禧小學</a>",
        "資助",
        "無",
        "屯門區",
        "71",
        "男女",
        null
      ],
      [
        "<a href=\"mcyos\">鄭任安夫人學校</a>",
        "資助",
        "無",
        "屯門區",
        "71",
        "男女",
        null
      ],
      [
        "<a href=\"pohckwps\">博愛醫院陳國威小學</a>",
        "資助",
        "無",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"tsaps\">台山商會學校</a>",
        "資助",
        "無",
        "屯門區",
        "70",
        "男女",
        null
      ],
      [
        "<a href=\"hycs\">合一堂學校</a>",
        "資助",
        "基督教",
        "九龍城",
        "34",
        "男女",
        null
      ],
      [
        "<a href=\"taipak\">吳氏宗親總會泰伯紀念學校</a>",
        "資助",
        "無",
        "沙田區",
        "89",
        "男女",
        null
      ],
      [
        "<a href=\"wfjlps\">和富慈善基金李宗德小學</a>",
        "直資",
        "無",
        "元朗區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"renaissance\">啓新書院</a>",
        "私立",
        "無",
        "沙田區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"ccs\">啟基學校</a>",
        "私立",
        "基督教",
        "深水埗",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"ccshki\">啟基學校(港島)</a>",
        "資助",
        "無",
        "東區",
        "14",
        "男女",
        null
      ],
      [
        "<a href=\"creative\">啟思小學</a>",
        "私立",
        "基督教",
        "九龍城",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"la-salle\">喇沙小學</a>",
        "資助",
        "天主教",
        "九龍城",
        "41",
        "男校",
        "直屬"
      ],
      [
        "<a href=\"hoshun\">嗇色園主辦可信學校</a>",
        "資助",
        "儒釋道",
        "荃灣區",
        "64",
        "男女",
        null
      ],
      [
        "<a href=\"holap\">嗇色園主辦可立小學</a>",
        "資助",
        "儒釋道",
        "黃大仙",
        "45",
        "男女",
        null
      ],
      [
        "<a href=\"hoyu\">可譽小學</a>",
        "資助",
        "儒釋道",
        "離島區",
        "98",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"homing\">嗇色園主辦可銘學校</a>",
        "資助",
        "儒釋道",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"ptcps\">嘉諾撒培德學校</a>",
        "資助",
        "天主教",
        "南區",
        "18",
        "女校",
        "聯繫"
      ],
      [
        "<a href=\"cpswts\">嘉諾撒小學</a>",
        "資助",
        "天主教",
        "黃大仙",
        "43",
        "男女",
        null
      ],
      [
        "<a href=\"cps\">嘉諾撒小學(新蒲崗)</a>",
        "資助",
        "天主教",
        "黃大仙",
        "45",
        "男女",
        null
      ],
      [
        "<a href=\"hfkc\">嘉諾撒聖家學校</a>",
        "資助",
        "天主教",
        "九龍城",
        "41",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"holyfamilykt\">嘉諾撒聖家學校(九龍塘)</a>",
        "資助",
        "天主教",
        "九龍城",
        "41",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"shcs\">嘉諾撒聖心學校</a>",
        "資助",
        "天主教",
        "中西區",
        "11",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"shcsps\">嘉諾撒聖心學校私立部</a>",
        "私立",
        "天主教",
        "中西區",
        "0",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"sfcs\">嘉諾撒聖方濟各學校</a>",
        "資助",
        "天主教",
        "灣仔區",
        "12",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"smcs\">嘉諾撒聖瑪利學校</a>",
        "資助",
        "天主教",
        "油尖旺",
        "31",
        "女校",
        "結龍"
      ],
      [
        "<a href=\"cckms\">國民學校</a>",
        "資助",
        "無",
        "離島區",
        "97",
        "男女",
        null
      ],
      [
        "<a href=\"icqm\">國際基督教優質音樂中學暨小學</a>",
        "私立",
        "基督教",
        "黃大仙",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"hingtak\">圓玄學院陳國超興德小學</a>",
        "資助",
        "無",
        "屯門區",
        "71",
        "男女",
        null
      ],
      [
        "<a href=\"deliamk\">地利亞(閩僑)英文小學</a>",
        "直資",
        "無",
        "葵青區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"delia\">地利亞英文小學暨幼稚園</a>",
        "私立",
        "無",
        "深水埗",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"psec\">坪石天主教小學</a>",
        "資助",
        "天主教",
        "觀塘區",
        "46",
        "男女",
        null
      ],
      [
        "<a href=\"pkps\">培僑小學</a>",
        "資助",
        "無",
        "東區",
        "16",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"puikiucollege\">培僑書院</a>",
        "直資",
        "無",
        "沙田區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"pooikei\">培基小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "91",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"hksasps\">基督教培恩小學</a>",
        "資助",
        "基督教",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"sunkei\">宣基小學</a>",
        "資助",
        "基督教",
        "西貢區",
        "95",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"sunkei2\">宣基小學(坪石)</a>",
        "資助",
        "基督教",
        "觀塘區",
        "46",
        "男女",
        null
      ],
      [
        "<a href=\"ccl\">徐澤林紀念小學</a>",
        "資助",
        "基督教",
        "元朗區",
        "74",
        "男女",
        null
      ],
      [
        "<a href=\"lsttko\">基督教神召會梁省德小學</a>",
        "資助",
        "基督教",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"fagps\">基督教粉嶺神召會小學</a>",
        "資助",
        "基督教",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"hgps\">基督教聖約教會堅樂小學</a>",
        "資助",
        "基督教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"hg2ps\">堅樂第二小學</a>",
        "資助",
        "基督教",
        "觀塘區",
        "46",
        "男女",
        null
      ],
      [
        "<a href=\"cwflls\">信愛學校</a>",
        "資助",
        "基督教",
        "東區",
        "16",
        "男女",
        null
      ],
      [
        "<a href=\"elchkls\">啟信學校</a>",
        "私立",
        "基督教",
        "元朗區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"luac\">宏信書院</a>",
        "直資",
        "基督教",
        "元朗區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"fls\">深信學校</a>",
        "資助",
        "基督教",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"wcl\">禾輋信義學校</a>",
        "資助",
        "基督教",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"hhlps\">紅磡信義學校</a>",
        "資助",
        "基督教",
        "九龍城",
        "34",
        "男女",
        null
      ],
      [
        "<a href=\"kslps\">葵盛信義學校</a>",
        "資助",
        "基督教",
        "葵青區",
        "65",
        "男女",
        null
      ],
      [
        "<a href=\"mluthps\">馬鞍山信義學校</a>",
        "資助",
        "基督教",
        "沙田區",
        "89",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"tmrgps\">塘尾道官立小學</a>",
        "官立",
        "無",
        "油尖旺",
        "32",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"apstht\">大坑東宣道小學</a>",
        "資助",
        "基督教",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"tpgps\">大埔官立小學</a>",
        "官立",
        "無",
        "大埔區",
        "84",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"wks\">大埔崇德黃建常紀念學校</a>",
        "資助",
        "無",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"tpms\">大埔循道衞理小學</a>",
        "資助",
        "基督教",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"tpbps\">大埔浸信會公立學校</a>",
        "資助",
        "基督教",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"tpomps\">大埔舊墟公立學校</a>",
        "資助",
        "無",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"tpompspc\">大埔舊墟公立學校(寶湖道)</a>",
        "資助",
        "無",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"tktcps\">大角嘴天主教小學</a>",
        "資助",
        "天主教",
        "油尖旺",
        "32",
        "男女",
        null
      ],
      [
        "<a href=\"tktcpshfr\">大角嘴天主教小學(海帆道)</a>",
        "資助",
        "天主教",
        "油尖旺",
        "32",
        "男女",
        null
      ],
      [
        "<a href=\"nwcps\">天主教伍華小學</a>",
        "資助",
        "天主教",
        "黃大仙",
        "43",
        "男女",
        "直屬"
      ],
      [
        "<a href=\"oloccp\">天主教佑華小學</a>",
        "資助",
        "天主教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"pmcps\">天主教博智小學</a>",
        "資助",
        "天主教",
        "黃大仙",
        "43",
        "男女",
        null
      ],
      [
        "<a href=\"gccps\">天主教善導小學</a>",
        "資助",
        "天主教",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"mengtakps\">天主教明德學校</a>",
        "資助",
        "天主教",
        "東區",
        "16",
        "男女",
        null
      ],
      [
        "<a href=\"bpcs\">天主教柏德學校</a>",
        "資助",
        "天主教",
        "觀塘區",
        "46",
        "男女",
        null
      ],
      [
        "<a href=\"scs\">天主教石鐘山紀念小學</a>",
        "資助",
        "天主教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"cms\">天主教總堂區學校</a>",
        "資助",
        "天主教",
        "中西區",
        "11",
        "男女",
        null
      ],
      [
        "<a href=\"sacps\">天主教聖安德肋小學</a>",
        "資助",
        "天主教",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"shmcps\">天主教聖母聖心小學</a>",
        "資助",
        "天主教",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"littleflower\">天主教聖華學校</a>",
        "資助",
        "天主教",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"lingto\">天主教領島學校</a>",
        "資助",
        "天主教",
        "九龍城",
        "34",
        "男女",
        null
      ],
      [
        "<a href=\"mpps\">天佑小學</a>",
        "資助",
        "天主教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"tswcps\">天水圍天主教小學</a>",
        "資助",
        "天主教",
        "元朗區",
        "72",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"tswgps\">天水圍官立小學</a>",
        "官立",
        "無",
        "元朗區",
        "72",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"tswmps\">天水圍循道衞理小學</a>",
        "資助",
        "基督教",
        "元朗區",
        "72",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"hacs\">天神嘉諾撒學校</a>",
        "資助",
        "天主教",
        "九龍城",
        "35",
        "女校",
        "結龍"
      ],
      [
        "<a href=\"tps\">太古小學</a>",
        "資助",
        "無",
        "東區",
        "14",
        "男女",
        null
      ],
      [
        "<a href=\"taishing\">孔教學院大成小學</a>",
        "資助",
        "孔教",
        "黃大仙",
        "43",
        "男女",
        null
      ],
      [
        "<a href=\"anchors\">安基司學校</a>",
        "私立",
        "無",
        "元朗區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"anfield\">安菲爾學校</a>",
        "私立",
        "無",
        "沙田區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"anfield-sen\">安菲爾聖鮑思高冠英學校</a>",
        "私立",
        "無",
        "元朗區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"sekps\">官立嘉道理爵士小學</a>",
        "官立",
        "無",
        "灣仔區",
        "12",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"casyymps\">宣道會葉紹蔭紀念小學</a>",
        "資助",
        "基督教",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"pocawhk\">寶安商會溫浩根小學</a>",
        "資助",
        "無",
        "離島區",
        "98",
        "男女",
        null
      ],
      [
        "<a href=\"pbps\">寶血小學</a>",
        "資助",
        "天主教",
        "灣仔區",
        "12",
        "男女",
        null
      ],
      [
        "<a href=\"kmw\">寶血會伍季明紀念學校</a>",
        "資助",
        "天主教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"kalingpb\">寶血會嘉靈學校</a>",
        "資助",
        "天主教",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"plpb\">寶血會培靈學校</a>",
        "資助",
        "天主教",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"sys\">寶血會思源學校</a>",
        "資助",
        "天主教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"pokokps\">寶覺小學</a>",
        "資助",
        "佛教",
        "灣仔區",
        "12",
        "男女",
        null
      ],
      [
        "<a href=\"tkocps\">將軍澳天主教小學</a>",
        "資助",
        "天主教",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"tkogps\">將軍澳官立小學</a>",
        "官立",
        "無",
        "西貢區",
        "95",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"tkomps\">將軍澳循道衞理小學</a>",
        "資助",
        "基督教",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"tmgps\">屯門官立小學</a>",
        "官立",
        "無",
        "屯門區",
        "70",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"ttpskg\">崇真小學暨幼稚園</a>",
        "私立",
        "基督教",
        "深水埗",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"luaaps\">嶺南大學香港同學會小學</a>",
        "直資",
        "基督教",
        "深水埗",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"crgps\">廣東道官立小學</a>",
        "官立",
        "無",
        "油尖旺",
        "31",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"isf\">弘立書院</a>",
        "私立",
        "無",
        "南區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"cwsj\">彩雲聖若瑟小學</a>",
        "資助",
        "天主教",
        "黃大仙",
        "45",
        "男女",
        null
      ],
      [
        "<a href=\"chunlei\">循理會白普理基金循理小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "88",
        "男女",
        null
      ],
      [
        "<a href=\"fmml\">循理會美林小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "88",
        "男女",
        null
      ],
      [
        "<a href=\"kmsch\">循道學校</a>",
        "資助",
        "基督教",
        "油尖旺",
        "31",
        "男女",
        null
      ],
      [
        "<a href=\"taksun\">德信學校</a>",
        "資助",
        "天主教",
        "油尖旺",
        "31",
        "男校",
        "聯繫"
      ],
      [
        "<a href=\"ghsps\">德望小學</a>",
        "私立",
        "天主教",
        "黃大仙",
        "0",
        "女校",
        null
      ],
      [
        "<a href=\"hilary\">德萃小學</a>",
        "私立",
        "無",
        "大埔區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"tcpsa\">德貞小學</a>",
        "私立",
        "天主教",
        "深水埗",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"tnps\">德雅小學</a>",
        "私立",
        "天主教",
        "深水埗",
        "0",
        "男女",
        "直屬"
      ],
      [
        "<a href=\"tys\">惇裕學校</a>",
        "資助",
        "無",
        "元朗區",
        "74",
        "男女",
        null
      ],
      [
        "<a href=\"abgps\">愛秩序灣官立小學</a>",
        "官立",
        "無",
        "東區",
        "16",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"salesian\">慈幼學校</a>",
        "資助",
        "天主教",
        "東區",
        "16",
        "男校",
        "直屬"
      ],
      [
        "<a href=\"syh\">慈幼葉漢千禧小學</a>",
        "資助",
        "天主教",
        "葵青區",
        "64",
        "男女",
        null
      ],
      [
        "<a href=\"syhps\">慈幼葉漢小學</a>",
        "資助",
        "天主教",
        "葵青區",
        "64",
        "男女",
        null
      ],
      [
        "<a href=\"chihong\">慈航學校</a>",
        "資助",
        "佛教",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"twscps\">慈雲山天主教小學</a>",
        "資助",
        "天主教",
        "黃大仙",
        "45",
        "男女",
        null
      ],
      [
        "<a href=\"tsbcps\">慈雲山聖文德天主教小學</a>",
        "資助",
        "天主教",
        "黃大仙",
        "45",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"tkllingying\">打鼓嶺嶺英公立學校</a>",
        "資助",
        "無",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"dgjs\">拔萃女小學</a>",
        "私立",
        "基督教",
        "油尖旺",
        "0",
        "女校",
        "結龍"
      ],
      [
        "<a href=\"dps\">拔萃小學</a>",
        "資助",
        "基督教",
        "九龍城",
        "41",
        "男女",
        null
      ],
      [
        "<a href=\"dbspd\">拔萃男書院附屬小學</a>",
        "直資",
        "基督教",
        "九龍城",
        "0",
        "男校",
        "結龍"
      ],
      [
        "<a href=\"evangel\">播道書院</a>",
        "直資",
        "基督教",
        "西貢區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"saccf\">救世軍中原慈善基金學校</a>",
        "資助",
        "基督教",
        "東區",
        "16",
        "男女",
        null
      ],
      [
        "<a href=\"saccfqhs\">救世軍中原慈善基金皇后山學校</a>",
        "資助",
        "基督教",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"salbcms\">救世軍林拔中紀念學校</a>",
        "資助",
        "基督教",
        "離島區",
        "98",
        "男女",
        null
      ],
      [
        "<a href=\"satkp\">救世軍田家炳學校</a>",
        "資助",
        "基督教",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"annwyllie\">救世軍韋理夫人紀念學校</a>",
        "資助",
        "基督教",
        "東區",
        "16",
        "男女",
        null
      ],
      [
        "<a href=\"kauyan\">救恩學校</a>",
        "私立",
        "基督教",
        "中西區",
        "0",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"swcss\">新會商會學校</a>",
        "資助",
        "無",
        "中西區",
        "11",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"swcscs\">新會商會港青基信學校</a>",
        "私立",
        "基督教",
        "深水埗",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"ntwjwacrgps\">新界婦孺福利會基督教銘恩小學</a>",
        "資助",
        "基督教",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"taipolst\">新界婦孺福利會梁省德學校</a>",
        "資助",
        "無",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"fsc\">方樹福堂基金方樹泉小學</a>",
        "資助",
        "無",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"hpccps\">旅港開平商會學校</a>",
        "資助",
        "無",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"caps\">晉德學校</a>",
        "私立",
        "無",
        "灣仔區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"klcps\">景林天主教小學</a>",
        "資助",
        "天主教",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"discovery\">智新書院</a>",
        "私立",
        "無",
        "離島區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"tmms\">曾梅千禧學校</a>",
        "資助",
        "無",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"lctms\">李志達紀念學校</a>",
        "資助",
        "無",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"lcu\">李鄭屋官立小學</a>",
        "官立",
        "無",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"lsths\">李陞大坑學校</a>",
        "資助",
        "無",
        "灣仔區",
        "12",
        "男女",
        null
      ],
      [
        "<a href=\"lsps\">李陞小學</a>",
        "官立",
        "無",
        "中西區",
        "11",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"buiosch\">杯澳公立學校</a>",
        "資助",
        "無",
        "離島區",
        "98",
        "男女",
        null
      ],
      [
        "<a href=\"tccs\">東涌天主教學校</a>",
        "資助",
        "天主教",
        "離島區",
        "98",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"tkfsc\">東莞同鄉會方樹泉學校</a>",
        "資助",
        "無",
        "油尖旺",
        "31",
        "男女",
        null
      ],
      [
        "<a href=\"tks\">東莞學校</a>",
        "資助",
        "無",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"cwwps\">東莞工商總會張煌偉小學</a>",
        "資助",
        "無",
        "沙田區",
        "88",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"scwps\">東華三院冼次雲小學</a>",
        "資助",
        "無",
        "沙田區",
        "88",
        "男女",
        null
      ],
      [
        "<a href=\"twghscysps\">東華三院周演森小學</a>",
        "資助",
        "無",
        "葵青區",
        "66",
        "男女",
        null
      ],
      [
        "<a href=\"ydc\">東華三院姚達之紀念小學</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"twghthpps\">東華三院曾憲備小學</a>",
        "資助",
        "無",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"twghlthlp\">東華三院李東海小學</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"twghlchps\">東華三院李賜豪小學</a>",
        "資助",
        "無",
        "灣仔區",
        "12",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"eama\">港九電器商聯會小學</a>",
        "資助",
        "無",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"wyjjmps\">王余家潔紀念小學</a>",
        "資助",
        "無",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"twghlycp\">東華三院羅裕積小學</a>",
        "資助",
        "無",
        "油尖旺",
        "31",
        "男女",
        null
      ],
      [
        "<a href=\"twghscops\">東華三院蔡榮星小學</a>",
        "資助",
        "無",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"twghtskp\">東華三院鄧肇堅小學</a>",
        "資助",
        "無",
        "屯門區",
        "71",
        "男女",
        null
      ],
      [
        "<a href=\"twghmkc\">馬錦燦紀念小學</a>",
        "資助",
        "無",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"twghkhnmp\">東華三院高可寧紀念小學</a>",
        "資助",
        "無",
        "葵青區",
        "65",
        "男女",
        null
      ],
      [
        "<a href=\"hokshan\">東華三院鶴山學校</a>",
        "資助",
        "無",
        "南區",
        "18",
        "男女",
        "直屬"
      ],
      [
        "<a href=\"wssps\">東華三院黃士心小學</a>",
        "資助",
        "無",
        "葵青區",
        "66",
        "男女",
        null
      ],
      [
        "<a href=\"wfl\">林村公立黃福鑾紀念學校</a>",
        "資助",
        "無",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"hosauki\">何壽基學校</a>",
        "資助",
        "無",
        "屯門區",
        "70",
        "男女",
        null
      ],
      [
        "<a href=\"lynms\">盧光輝紀念學校</a>",
        "資助",
        "無",
        "葵青區",
        "65",
        "男女",
        null
      ],
      [
        "<a href=\"austin\">柯士甸學校</a>",
        "私立",
        "無",
        "油尖旺",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"cwk\">柴灣角天主教小學</a>",
        "資助",
        "天主教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"mws\">梅窩學校</a>",
        "資助",
        "無",
        "離島區",
        "98",
        "男女",
        null
      ],
      [
        "<a href=\"lmscps\">梨木樹天主教小學</a>",
        "資助",
        "天主教",
        "荃灣區",
        "64",
        "男女",
        null
      ],
      [
        "<a href=\"lautak\">樂善堂劉德學校</a>",
        "資助",
        "無",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"lstps\">樂善堂小學</a>",
        "資助",
        "無",
        "九龍城",
        "41",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"lstlkkps\">樂善堂梁銶琚學校</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"lstlkkb\">樂善堂梁銶琚學校(分校)</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"lstlwwf\">樂善堂梁黃蕙芳紀念學校</a>",
        "資助",
        "無",
        "屯門區",
        "70",
        "男女",
        null
      ],
      [
        "<a href=\"ycmps\">樂善堂楊仲明學校</a>",
        "資助",
        "無",
        "觀塘區",
        "48",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"lwcps\">樂華天主教小學</a>",
        "資助",
        "天主教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"forest\">樹宏學校</a>",
        "私立",
        "無",
        "西貢區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"munsang\">民生書院小學</a>",
        "私立",
        "基督教",
        "九龍城",
        "0",
        "男女",
        "直屬"
      ],
      [
        "<a href=\"dcfwms-stw\">沙田圍胡素貞博士紀念學校</a>",
        "資助",
        "無",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"stgps\">沙田官立小學</a>",
        "官立",
        "無",
        "沙田區",
        "88",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"stts\">沙田崇真學校</a>",
        "資助",
        "基督教",
        "沙田區",
        "91",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"smps\">沙田循道衞理小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"stkcps\">沙頭角中心小學</a>",
        "資助",
        "無",
        "北區",
        "83",
        "男女",
        null
      ],
      [
        "<a href=\"ymtcps\">油蔴地天主教小學</a>",
        "資助",
        "天主教",
        "油尖旺",
        "31",
        "男女",
        null
      ],
      [
        "<a href=\"ycps\">油蔴地天主教小學(海泓道)</a>",
        "資助",
        "天主教",
        "油尖旺",
        "31",
        "男女",
        null
      ],
      [
        "<a href=\"ymtkfas\">油蔴地街坊會學校</a>",
        "資助",
        "無",
        "油尖旺",
        "31",
        "男女",
        null
      ],
      [
        "<a href=\"hpsgps\">海壩街官立小學</a>",
        "官立",
        "無",
        "荃灣區",
        "62",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"pbpssh\">海怡寶血小學</a>",
        "資助",
        "天主教",
        "南區",
        "18",
        "男女",
        null
      ],
      [
        "<a href=\"lmc\">浸信宣道會呂明才小學</a>",
        "資助",
        "基督教",
        "觀塘區",
        "46",
        "男女",
        null
      ],
      [
        "<a href=\"lmcps\">浸信會呂明才小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "91",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"rainbow\">浸信會天虹小學</a>",
        "資助",
        "基督教",
        "黃大仙",
        "43",
        "男女",
        null
      ],
      [
        "<a href=\"bstwlmc\">浸信會沙田圍呂明才小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "91",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"stcpri\">深井天主教小學</a>",
        "資助",
        "天主教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"sspkw\">深水埔街坊福利會小學</a>",
        "資助",
        "無",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"sspgps\">深水埗官立小學</a>",
        "官立",
        "無",
        "深水埗",
        "40",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"sfc\">港九街坊婦女會孫方中小學</a>",
        "資助",
        "無",
        "大埔區",
        "84",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"hkugaps\">港大同學會小學</a>",
        "直資",
        "無",
        "東區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"hkmlcps\">港澳信義會小學</a>",
        "資助",
        "基督教",
        "西貢區",
        "95",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"hkmlc-mtps\">港澳信義會明道小學</a>",
        "資助",
        "基督教",
        "西貢區",
        "95",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"wcsy\">黃陳淑英紀念學校</a>",
        "資助",
        "基督教",
        "元朗區",
        "74",
        "男女",
        null
      ],
      [
        "<a href=\"sap\">滬江小學</a>",
        "資助",
        "無",
        "東區",
        "14",
        "男女",
        null
      ],
      [
        "<a href=\"vsa\">滬江維多利亞學校</a>",
        "私立",
        "無",
        "南區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"vnsaa\">漢師德萃學校</a>",
        "私立",
        "無",
        "油尖旺",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"honwah\">漢華中學(小學部)</a>",
        "直資",
        "無",
        "東區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"han\">漢鼎書院</a>",
        "私立",
        "無",
        "南區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"cypy\">潮陽百欣小學</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"gigamind\">激活英文小學</a>",
        "私立",
        "基督教",
        "元朗區",
        "0",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"htsps\">獅子會何德心小學</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"ops\">獻主會小學</a>",
        "資助",
        "天主教",
        "九龍城",
        "34",
        "男女",
        null
      ],
      [
        "<a href=\"poyan\">獻主會溥仁小學</a>",
        "資助",
        "天主教",
        "黃大仙",
        "43",
        "男女",
        null
      ],
      [
        "<a href=\"semops\">獻主會聖馬善樂小學</a>",
        "資助",
        "天主教",
        "九龍城",
        "34",
        "男女",
        null
      ],
      [
        "<a href=\"rhsps\">玫瑰崗學校(小學部)</a>",
        "私立",
        "天主教",
        "灣仔區",
        "0",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"rosebud\">玫瑰蕾小學</a>",
        "私立",
        "無",
        "荃灣區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"mps\">瑪利曼小學</a>",
        "資助",
        "天主教",
        "灣仔區",
        "12",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"mcsps\">瑪利諾修院學校(小學部)</a>",
        "資助",
        "天主教",
        "九龍城",
        "41",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"mfpps\">瑪利諾神父教會學校(小學部)</a>",
        "資助",
        "天主教",
        "深水埗",
        "40",
        "男女",
        "直屬"
      ],
      [
        "<a href=\"puawyps\">番禺會所華仁小學</a>",
        "資助",
        "天主教",
        "東區",
        "14",
        "男校",
        "直屬"
      ],
      [
        "<a href=\"bloom\">百卉九江書院</a>",
        "私立",
        "無",
        "深水埗",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"cts\">真鐸學校</a>",
        "資助",
        "基督教",
        "黃大仙",
        "45",
        "男女",
        null
      ],
      [
        "<a href=\"swhps\">石湖墟公立學校</a>",
        "資助",
        "無",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"sheklei\">石籬天主教小學</a>",
        "資助",
        "天主教",
        "葵青區",
        "64",
        "男女",
        null
      ],
      [
        "<a href=\"slsj\">石籬聖若望天主教小學</a>",
        "資助",
        "天主教",
        "葵青區",
        "64",
        "男女",
        null
      ],
      [
        "<a href=\"shema\">示昕學校</a>",
        "私立",
        "基督教",
        "觀塘區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"choyiu\">祖堯天主教小學</a>",
        "資助",
        "天主教",
        "葵青區",
        "65",
        "男女",
        null
      ],
      [
        "<a href=\"aogsthilarys\">神召會德萃書院(小學部)</a>",
        "私立",
        "無",
        "黃大仙",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"faogps\">神召第一小學</a>",
        "私立",
        "基督教",
        "九龍城",
        "0",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"fssas\">福建中學附屬學校</a>",
        "直資",
        "無",
        "觀塘區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"bfordms\">福德學校</a>",
        "資助",
        "天主教",
        "黃大仙",
        "43",
        "男女",
        null
      ],
      [
        "<a href=\"shantsui\">福德學社小學</a>",
        "資助",
        "無",
        "北區",
        "83",
        "男女",
        null
      ],
      [
        "<a href=\"fwsgps\">福榮街官立小學</a>",
        "官立",
        "無",
        "深水埗",
        "40",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"saumingps\">秀明小學</a>",
        "資助",
        "無",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"smpcps\">秀茂坪天主教小學</a>",
        "資助",
        "天主教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"skwgps\">筲箕灣官立小學</a>",
        "官立",
        "無",
        "東區",
        "16",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"skwtts\">筲箕灣崇真學校</a>",
        "資助",
        "基督教",
        "東區",
        "16",
        "男女",
        null
      ],
      [
        "<a href=\"flp\">粉嶺公立學校</a>",
        "資助",
        "無",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"fgps\">粉嶺官立小學</a>",
        "官立",
        "無",
        "北區",
        "81",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"iushan\">耀山學校</a>",
        "資助",
        "無",
        "九龍城",
        "41",
        "男女",
        null
      ],
      [
        "<a href=\"htps\">聖三一堂小學</a>",
        "私立",
        "基督教",
        "九龍城",
        "0",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"spcps\">聖伯多祿天主教小學</a>",
        "資助",
        "天主教",
        "南區",
        "18",
        "男女",
        "直屬"
      ],
      [
        "<a href=\"sppcs\">聖保祿天主教小學</a>",
        "資助",
        "天主教",
        "灣仔區",
        "12",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"spcspr\">聖保祿學校(小學部)</a>",
        "私立",
        "天主教",
        "灣仔區",
        "0",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"spc-ps\">聖保羅書院小學</a>",
        "直資",
        "基督教",
        "南區",
        "0",
        "男校",
        "直屬"
      ],
      [
        "<a href=\"spccps\">聖保羅男女中學附屬小學</a>",
        "直資",
        "基督教",
        "南區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"chuyan\">聖公會主恩小學</a>",
        "資助",
        "基督教",
        "葵青區",
        "65",
        "男女",
        null
      ],
      [
        "<a href=\"chuoi\">聖公會主愛小學</a>",
        "資助",
        "基督教",
        "葵青區",
        "64",
        "男女",
        null
      ],
      [
        "<a href=\"chuoi-lms\">聖公會主愛小學(梨木樹)</a>",
        "資助",
        "基督教",
        "荃灣區",
        "64",
        "男女",
        null
      ],
      [
        "<a href=\"skhhsst\">聖公會主風小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"kbkeilok\">聖公會九龍灣基樂小學</a>",
        "資助",
        "基督教",
        "觀塘區",
        "46",
        "男女",
        null
      ],
      [
        "<a href=\"yanlaap\">聖公會仁立小學</a>",
        "資助",
        "基督教",
        "葵青區",
        "65",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"ylm\">聖公會仁立紀念小學</a>",
        "資助",
        "基督教",
        "葵青區",
        "65",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"skhhcw\">聖公會何澤芸小學</a>",
        "資助",
        "基督教",
        "葵青區",
        "66",
        "男女",
        null
      ],
      [
        "<a href=\"skhweilun\">聖公會偉倫小學</a>",
        "資助",
        "基督教",
        "離島區",
        "99",
        "男女",
        null
      ],
      [
        "<a href=\"skhlmcmps\">聖公會呂明才紀念小學</a>",
        "資助",
        "基督教",
        "中西區",
        "11",
        "男女",
        null
      ],
      [
        "<a href=\"skhkfwc\">聖公會嘉福榮真小學</a>",
        "資助",
        "基督教",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"skhkt\">聖公會基德小學</a>",
        "資助",
        "基督教",
        "黃大仙",
        "43",
        "男女",
        null
      ],
      [
        "<a href=\"skhkyps\">聖公會基恩小學</a>",
        "資助",
        "基督教",
        "中西區",
        "11",
        "男女",
        null
      ],
      [
        "<a href=\"keioi\">聖公會基愛小學</a>",
        "資助",
        "基督教",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"skhkwps\">聖公會基榮小學</a>",
        "資助",
        "基督教",
        "油尖旺",
        "32",
        "男女",
        null
      ],
      [
        "<a href=\"keilok\">聖公會基樂小學</a>",
        "資助",
        "基督教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"keifook\">聖公會基福小學</a>",
        "資助",
        "基督教",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"skhkeihin\">聖公會基顯小學</a>",
        "資助",
        "基督教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"skhtswlo\">聖公會天水圍靈愛小學</a>",
        "資助",
        "基督教",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"fkmps\">聖公會奉基千禧小學</a>",
        "資助",
        "基督教",
        "九龍城",
        "35",
        "男女",
        null
      ],
      [
        "<a href=\"fungkei\">聖公會奉基小學</a>",
        "資助",
        "基督教",
        "九龍城",
        "35",
        "男女",
        null
      ],
      [
        "<a href=\"tkokt\">聖公會將軍澳基德小學</a>",
        "資助",
        "基督教",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"skhttlsk\">聖公會德田李兆強小學</a>",
        "資助",
        "基督教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"yatsau\">聖公會日修小學</a>",
        "資助",
        "基督教",
        "黃大仙",
        "34",
        "男女",
        null
      ],
      [
        "<a href=\"skhlsk\">聖公會李兆強小學</a>",
        "資助",
        "基督教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"skhcwsms\">聖公會柴灣聖米迦勒小學</a>",
        "資助",
        "基督教",
        "東區",
        "16",
        "男女",
        null
      ],
      [
        "<a href=\"skhwc\">聖公會榮真小學</a>",
        "資助",
        "基督教",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"skhykh\">聖公會油塘基顯小學</a>",
        "資助",
        "基督教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"gsps\">聖公會牧愛小學</a>",
        "資助",
        "基督教",
        "九龍城",
        "34",
        "男女",
        null
      ],
      [
        "<a href=\"tcn\">聖公會田灣始南小學</a>",
        "資助",
        "基督教",
        "南區",
        "18",
        "男女",
        null
      ],
      [
        "<a href=\"skhcfcn\">聖公會置富始南小學</a>",
        "資助",
        "基督教",
        "南區",
        "18",
        "男女",
        null
      ],
      [
        "<a href=\"hcps\">聖公會聖匠小學</a>",
        "資助",
        "基督教",
        "九龍城",
        "34",
        "男女",
        null
      ],
      [
        "<a href=\"skhhc\">聖公會聖十架小學</a>",
        "資助",
        "基督教",
        "九龍城",
        "34",
        "男女",
        null
      ],
      [
        "<a href=\"skhstthomas\">聖公會聖多馬小學</a>",
        "資助",
        "基督教",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"skhstandrews\">聖公會聖安德烈小學</a>",
        "資助",
        "基督教",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"spps\">聖公會聖彼得小學</a>",
        "資助",
        "基督教",
        "中西區",
        "11",
        "男女",
        null
      ],
      [
        "<a href=\"stps\">聖公會聖提摩太小學</a>",
        "資助",
        "基督教",
        "九龍城",
        "35",
        "男女",
        null
      ],
      [
        "<a href=\"skhsms\">聖公會聖米迦勒小學</a>",
        "資助",
        "基督教",
        "東區",
        "14",
        "男女",
        null
      ],
      [
        "<a href=\"skhscps\">聖公會聖紀文小學</a>",
        "資助",
        "基督教",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"skhstjoseph\">聖公會聖約瑟小學</a>",
        "資助",
        "基督教",
        "元朗區",
        "74",
        "男女",
        null
      ],
      [
        "<a href=\"skhstjohn\">聖公會聖約翰曾肇添小學</a>",
        "資助",
        "基督教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"skhstjames\">聖公會聖雅各小學</a>",
        "資助",
        "基督教",
        "灣仔區",
        "12",
        "男女",
        null
      ],
      [
        "<a href=\"stmatthew\">聖公會聖馬太小學</a>",
        "資助",
        "基督教",
        "中西區",
        "11",
        "男女",
        null
      ],
      [
        "<a href=\"skhmungyanps\">聖公會蒙恩小學</a>",
        "資助",
        "基督教",
        "屯門區",
        "71",
        "男女",
        null
      ],
      [
        "<a href=\"skhycmcps\">聖公會阮鄭夢芹小學</a>",
        "資助",
        "基督教",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"skhycmcj\">聖公會阮鄭夢芹銀禧小學</a>",
        "資助",
        "基督教",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"lingoi\">聖公會靈愛小學</a>",
        "資助",
        "基督教",
        "元朗區",
        "73",
        "男女",
        null
      ],
      [
        "<a href=\"tycy\">聖公會青衣主恩小學</a>",
        "資助",
        "基督教",
        "葵青區",
        "66",
        "男女",
        null
      ],
      [
        "<a href=\"tyehcwps\">聖公會青衣邨何澤芸小學</a>",
        "資助",
        "基督教",
        "葵青區",
        "66",
        "男女",
        null
      ],
      [
        "<a href=\"skhcs\">聖公會靜山小學</a>",
        "資助",
        "基督教",
        "黃大仙",
        "34",
        "男女",
        null
      ],
      [
        "<a href=\"skhmoshs\">聖公會馬鞍山主風小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "89",
        "男女",
        null
      ],
      [
        "<a href=\"spcpspkv\">聖博德天主教小學</a>",
        "資助",
        "天主教",
        "黃大仙",
        "45",
        "男女",
        null
      ],
      [
        "<a href=\"sps\">聖博德學校</a>",
        "資助",
        "天主教",
        "黃大仙",
        "43",
        "男女",
        null
      ],
      [
        "<a href=\"scps\">聖嘉勒小學</a>",
        "私立",
        "天主教",
        "中西區",
        "0",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"stcharles\">聖嘉祿學校</a>",
        "資助",
        "天主教",
        "中西區",
        "11",
        "男女",
        null
      ],
      [
        "<a href=\"ssgps\">聖士提反女子中學附屬小學</a>",
        "資助",
        "基督教",
        "中西區",
        "11",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"sscps\">聖士提反書院附屬小學</a>",
        "私立",
        "基督教",
        "南區",
        "0",
        "男女",
        "直屬"
      ],
      [
        "<a href=\"stanthonys\">聖安多尼學校</a>",
        "資助",
        "天主教",
        "中西區",
        "11",
        "男女",
        null
      ],
      [
        "<a href=\"saps\">聖安當小學</a>",
        "資助",
        "天主教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"holyfamily\">聖家學校</a>",
        "資助",
        "天主教",
        "離島區",
        "99",
        "男女",
        null
      ],
      [
        "<a href=\"stedward\">聖愛德華天主教小學</a>",
        "資助",
        "天主教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"sbcps\">聖文德天主教小學</a>",
        "資助",
        "天主教",
        "黃大仙",
        "45",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"sfaeps\">聖方濟各英文小學</a>",
        "私立",
        "天主教",
        "深水埗",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"sfacs\">聖方濟愛德小學</a>",
        "資助",
        "天主教",
        "深水埗",
        "40",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"olps\">聖母小學</a>",
        "私立",
        "天主教",
        "黃大仙",
        "0",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"ihms\">聖母無玷聖心學校</a>",
        "資助",
        "天主教",
        "沙田區",
        "88",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"smcesps\">聖瑪加利男女英文中小學</a>",
        "直資",
        "天主教",
        "深水埗",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"srols\">聖羅撒學校</a>",
        "資助",
        "天主教",
        "九龍城",
        "34",
        "女校",
        "直屬"
      ],
      [
        "<a href=\"sjcps\">聖若望英文書院(小學部)</a>",
        "私立",
        "天主教",
        "九龍城",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"sjps\">聖若瑟小學</a>",
        "資助",
        "天主教",
        "灣仔區",
        "12",
        "男校",
        "直屬"
      ],
      [
        "<a href=\"sjacps\">聖若瑟英文小學</a>",
        "私立",
        "天主教",
        "觀塘區",
        "0",
        "男校",
        "直屬"
      ],
      [
        "<a href=\"sjbcps\">聖若翰天主教小學</a>",
        "資助",
        "天主教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"stlouisps\">聖類斯中學(小學部)</a>",
        "私立",
        "天主教",
        "中西區",
        "0",
        "男校",
        "直屬"
      ],
      [
        "<a href=\"stmarks\">聖馬可小學</a>",
        "資助",
        "基督教",
        "東區",
        "16",
        "男女",
        null
      ],
      [
        "<a href=\"yukyin\">育賢學校</a>",
        "資助",
        "無",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"dcfwms\">胡素貞博士紀念學校</a>",
        "資助",
        "無",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"brgps\">般咸道官立小學</a>",
        "官立",
        "無",
        "中西區",
        "11",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"ghws\">花園華德福學校</a>",
        "私立",
        "無",
        "西貢區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"kcobaps1\">英皇書院同學會小學</a>",
        "資助",
        "無",
        "中西區",
        "11",
        "男女",
        null
      ],
      [
        "<a href=\"kcobaps2\">英皇書院同學會小學第二校</a>",
        "資助",
        "無",
        "中西區",
        "11",
        "男女",
        null
      ],
      [
        "<a href=\"yingwaps\">英華小學</a>",
        "直資",
        "基督教",
        "深水埗",
        "0",
        "男校",
        "結龍"
      ],
      [
        "<a href=\"zenith\">英藝英文小學</a>",
        "私立",
        "無",
        "元朗區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"twpsch\">荃灣公立何傳耀紀念小學</a>",
        "資助",
        "無",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"twtaps\">荃灣商會學校</a>",
        "資助",
        "無",
        "葵青區",
        "66",
        "男女",
        null
      ],
      [
        "<a href=\"twcps\">荃灣天主教小學</a>",
        "資助",
        "天主教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"twgps\">荃灣官立小學</a>",
        "官立",
        "無",
        "荃灣區",
        "62",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"twccps\">荃灣潮州公學</a>",
        "資助",
        "無",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"lcps\">荔枝角天主教小學</a>",
        "資助",
        "天主教",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"pbpswfe\">華富邨寶血小學</a>",
        "資助",
        "天主教",
        "南區",
        "18",
        "男女",
        null
      ],
      [
        "<a href=\"bishopwalsh\">華德學校</a>",
        "資助",
        "天主教",
        "九龍城",
        "41",
        "男女",
        null
      ],
      [
        "<a href=\"gcewps\">葛量洪校友會黃埔學校</a>",
        "資助",
        "無",
        "九龍城",
        "35",
        "男女",
        null
      ],
      [
        "<a href=\"ltmps\">藍田循道衞理小學</a>",
        "資助",
        "基督教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"kcps2\">蘇浙小學</a>",
        "私立",
        "無",
        "東區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"lsy\">李少欽紀念學校</a>",
        "資助",
        "無",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"stcps\">西貢崇真天主教學校小學部</a>",
        "資助",
        "天主教",
        "西貢區",
        "95",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"ktgps\">觀塘官立小學</a>",
        "官立",
        "無",
        "觀塘區",
        "48",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"ktgps-smr\">觀塘官立小學(秀明道)</a>",
        "官立",
        "無",
        "觀塘區",
        "48",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"lckps\">路德會呂祥光小學</a>",
        "資助",
        "基督教",
        "屯門區",
        "71",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"lkklps\">路德會梁鉅鏐小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "91",
        "男女",
        null
      ],
      [
        "<a href=\"sharonlu\">路德會沙崙學校</a>",
        "資助",
        "基督教",
        "油尖旺",
        "32",
        "男女",
        null
      ],
      [
        "<a href=\"hcls\">路德會聖十架學校</a>",
        "資助",
        "基督教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"smssmp\">路德會聖馬太學校(秀茂坪)</a>",
        "資助",
        "基督教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"hrgpsam\">軒尼詩道官立小學</a>",
        "官立",
        "無",
        "灣仔區",
        "12",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"hrgpspm\">軒尼詩道官立小學(銅鑼灣)</a>",
        "官立",
        "無",
        "灣仔區",
        "12",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"frgps\">農圃道官立小學</a>",
        "官立",
        "無",
        "九龍城",
        "34",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"calps\">迦密愛禮信小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "88",
        "男女",
        null
      ],
      [
        "<a href=\"clst\">迦密梁省德學校</a>",
        "資助",
        "基督教",
        "觀塘區",
        "46",
        "男女",
        null
      ],
      [
        "<a href=\"ttsch\">通德學校</a>",
        "資助",
        "無",
        "元朗區",
        "74",
        "男女",
        null
      ],
      [
        "<a href=\"tccps\">道教青松小學</a>",
        "資助",
        "道教",
        "屯門區",
        "70",
        "男女",
        null
      ],
      [
        "<a href=\"tccpswke\">道教青松小學(湖景邨)</a>",
        "資助",
        "道教",
        "屯門區",
        "70",
        "男女",
        null
      ],
      [
        "<a href=\"fcms\">郭怡雅神父紀念學校</a>",
        "資助",
        "天主教",
        "葵青區",
        "66",
        "男女",
        null
      ],
      [
        "<a href=\"gaia\">鄉師自然學校</a>",
        "私立",
        "無",
        "屯門區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"cpcyd\">金巴崙長老會耀道小學</a>",
        "資助",
        "基督教",
        "元朗區",
        "72",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"ktvhts\">金錢村何東學校</a>",
        "資助",
        "無",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"silverminebayschool\">銀礦灣學校</a>",
        "私立",
        "無",
        "離島區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"ktmy\">錦田公立蒙養學校</a>",
        "資助",
        "無",
        "元朗區",
        "74",
        "男女",
        null
      ],
      [
        "<a href=\"chungsing\">鐘聲學校</a>",
        "資助",
        "無",
        "元朗區",
        "74",
        "男女",
        null
      ],
      [
        "<a href=\"paktin\">長沙灣天主教小學</a>",
        "資助",
        "天主教",
        "深水埗",
        "40",
        "男女",
        null
      ],
      [
        "<a href=\"ccshs\">長洲聖心學校</a>",
        "資助",
        "天主教",
        "離島區",
        "97",
        "男女",
        null
      ],
      [
        "<a href=\"mkaps\">閩僑小學</a>",
        "資助",
        "無",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"cskps\">陳瑞祺(喇沙)小學</a>",
        "資助",
        "天主教",
        "九龍城",
        "34",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"emm\">靈光小學</a>",
        "資助",
        "基督教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"llcst\">靈糧堂秀德小學</a>",
        "資助",
        "基督教",
        "離島區",
        "98",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"cpcps\">青山天主教小學</a>",
        "資助",
        "天主教",
        "屯門區",
        "71",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"cchpwps\">青松侯寶垣小學</a>",
        "資助",
        "道教",
        "離島區",
        "98",
        "男女",
        null
      ],
      [
        "<a href=\"tytaps\">青衣商會小學</a>",
        "資助",
        "無",
        "葵青區",
        "66",
        "男女",
        null
      ],
      [
        "<a href=\"stfawmtps\">順德聯誼總會伍冕端小學</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"hytps\">順德聯誼總會何日東小學</a>",
        "資助",
        "無",
        "屯門區",
        "71",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"leekamps\">順德聯誼總會李金小學</a>",
        "資助",
        "無",
        "屯門區",
        "71",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"lkw\">順德聯誼總會梁潔華小學</a>",
        "資助",
        "無",
        "西貢區",
        "95",
        "男女",
        null
      ],
      [
        "<a href=\"wsk\">胡少渠紀念小學</a>",
        "資助",
        "無",
        "屯門區",
        "71",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"iwshk\">香島華德福學校</a>",
        "私立",
        "無",
        "中西區",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"irgps\">香島道官立小學</a>",
        "官立",
        "無",
        "南區",
        "18",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"wisdom\">佛教正慧小學</a>",
        "資助",
        "佛教",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"bcklas\">佛教正覺蓮社學校</a>",
        "資助",
        "佛教",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"bcsw\">佛教陳式宏學校</a>",
        "資助",
        "佛教",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"bwcss\">佛教黃藻森學校</a>",
        "資助",
        "佛教",
        "西貢區",
        "95",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"hkcwc-htyps\">丘佐榮學校</a>",
        "資助",
        "無",
        "東區",
        "16",
        "男女",
        null
      ],
      [
        "<a href=\"tcps\">張煊昌學校</a>",
        "資助",
        "無",
        "沙田區",
        "88",
        "男女",
        null
      ],
      [
        "<a href=\"catshcc\">台山陳元喜小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "89",
        "男女",
        null
      ],
      [
        "<a href=\"cahcc\">宣道會陳元喜小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "88",
        "男女",
        null
      ],
      [
        "<a href=\"aspcps\">香港仔聖伯多祿天主教小學</a>",
        "資助",
        "天主教",
        "南區",
        "18",
        "男女",
        "直屬"
      ],
      [
        "<a href=\"hksdgps\">香港南區官立小學</a>",
        "官立",
        "無",
        "南區",
        "18",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"canossahk\">香港嘉諾撒學校</a>",
        "資助",
        "天主教",
        "東區",
        "14",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"sycias\">香港四邑商工總會新會商會學校</a>",
        "資助",
        "無",
        "深水埗",
        "40",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"pcps\">香港培正小學</a>",
        "私立",
        "基督教",
        "九龍城",
        "0",
        "男女",
        "直屬"
      ],
      [
        "<a href=\"ptps\">香港培道小學</a>",
        "私立",
        "基督教",
        "九龍城",
        "0",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"malvern\">香港墨爾文國際學校</a>",
        "私立",
        "無",
        "大埔區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"wycombeabbey\">香港威雅學校</a>",
        "私立",
        "無",
        "南區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"hkaa\">香港復臨學校</a>",
        "私立",
        "基督教",
        "西貢區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"iedjcps\">香港教育大學賽馬會小學</a>",
        "資助",
        "無",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"hkfewwcb\">黃楚標學校</a>",
        "資助",
        "無",
        "離島區",
        "98",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"xpypssc\">香港普通話研習社科技創意小學</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"hkbcps\">香港浸信會聯會小學</a>",
        "資助",
        "基督教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"hkbuas\">王錦輝中小學</a>",
        "直資",
        "基督教",
        "沙田區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"csshk\">香港潮商學校</a>",
        "資助",
        "無",
        "中西區",
        "11",
        "男女",
        null
      ],
      [
        "<a href=\"cyps\">香港潮陽小學</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        null
      ],
      [
        "<a href=\"tlmshkps\">香港真光中學小學部</a>",
        "私立",
        "基督教",
        "灣仔區",
        "0",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"hkrsstmps\">香港紅卍字會屯門卍慈小學</a>",
        "資助",
        "無",
        "屯門區",
        "70",
        "男女",
        null
      ],
      [
        "<a href=\"logosacademy\">真道書院</a>",
        "直資",
        "基督教",
        "西貢區",
        "0",
        "男女",
        "結龍"
      ],
      [
        "<a href=\"ltssls\">香港路德會增城兆霖學校</a>",
        "資助",
        "基督教",
        "屯門區",
        "70",
        "男女",
        null
      ],
      [
        "<a href=\"swk\">圓玄學院石圍角小學</a>",
        "資助",
        "道教",
        "荃灣區",
        "62",
        "男女",
        null
      ],
      [
        "<a href=\"clcts\">陳呂重德紀念學校</a>",
        "資助",
        "道教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"syps\">香港道教聯合會純陽小學</a>",
        "資助",
        "道教",
        "沙田區",
        "89",
        "男女",
        null
      ],
      [
        "<a href=\"nlw\">吳禮和紀念學校</a>",
        "資助",
        "道教",
        "大埔區",
        "84",
        "男女",
        null
      ],
      [
        "<a href=\"hktawts\">香港道教聯合會雲泉學校</a>",
        "資助",
        "道教",
        "觀塘區",
        "48",
        "男女",
        null
      ],
      [
        "<a href=\"dshk\">香港道爾頓學校</a>",
        "私立",
        "無",
        "油尖旺",
        "0",
        "男女",
        null
      ],
      [
        "<a href=\"lskps\">香港青年協會李兆基小學</a>",
        "資助",
        "無",
        "元朗區",
        "72",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"mosmps\">馬鞍山循道衞理小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "89",
        "男女",
        null
      ],
      [
        "<a href=\"mossjps\">馬鞍山聖若瑟小學</a>",
        "資助",
        "天主教",
        "沙田區",
        "89",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"moslingliang\">馬鞍山靈糧小學</a>",
        "資助",
        "基督教",
        "沙田區",
        "89",
        "男女",
        null
      ],
      [
        "<a href=\"mtcgps\">馬頭涌官立小學</a>",
        "官立",
        "無",
        "九龍城",
        "34",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"mtchhb\">馬頭涌官立小學(紅磡灣)</a>",
        "官立",
        "無",
        "九龍城",
        "35",
        "男女",
        "聯繫"
      ],
      [
        "<a href=\"rcps\">高主教書院小學部</a>",
        "私立",
        "天主教",
        "灣仔區",
        "0",
        "男女",
        "直屬"
      ],
      [
        "<a href=\"ffts\">鮮魚行學校</a>",
        "資助",
        "無",
        "油尖旺",
        "32",
        "男女",
        null
      ],
      [
        "<a href=\"fkis\">鳳溪創新小學</a>",
        "資助",
        "無",
        "北區",
        "80",
        "男女",
        null
      ],
      [
        "<a href=\"fklysms\">鳳溪廖潤琛紀念學校</a>",
        "資助",
        "無",
        "北區",
        "81",
        "男女",
        null
      ],
      [
        "<a href=\"fungkai\">鳳溪第一小學</a>",
        "資助",
        "無",
        "北區",
        "80",
        "男女",
        "直屬"
      ],
      [
        "<a href=\"akps\">鴨脷洲街坊學校</a>",
        "資助",
        "無",
        "南區",
        "18",
        "男女",
        null
      ],
      [
        "<a href=\"apsw\">黃埔宣道小學</a>",
        "資助",
        "基督教",
        "九龍城",
        "35",
        "男女",
        null
      ],
      [
        "<a href=\"wtscps\">黃大仙天主教小學</a>",
        "資助",
        "天主教",
        "黃大仙",
        "43",
        "男女",
        null
      ],
      [
        "<a href=\"wtsgps\">黃大仙官立小學</a>",
        "官立",
        "無",
        "黃大仙",
        "43",
        "男女",
        "聯繫"
      ]
    ]
  };

const sReg = /(?<=\>).*?(?=\<)/i;

async function insertData() {
    const newData = data['data'].map((item) => {
        const newItem = {
            name: item['0'].match(sReg)[0],
            type: item['1']?item['1']:'None',
            district: item['3']?item['3']:'None',
            net: item['4']?item['4']:'None',
            relation: item['6']?item['6']:'None',
            sex: item['5']?item['5']:'None',
            religion: item['2']?item['2']:'None'
        }
        return newItem;
    });
    console.log('newData', newData.length);
    await hongkongPSModel.insertMany(newData);
}

async function main() {
    try {
        await insertData();
        process.exit(0);
    } catch (e) {
        logger.error(`Error: ${e}`);
        process.exit(1);
    }
}

main();

