const { hongkongMiddleSchoolModel } = require('../models');
const moment = require('moment');
const log4js = require('log4js');
const logger = log4js.getLogger();
logger.level = 'info';

const data = {
    "draw": 1,
    "recordsTotal": 473,
    "recordsFiltered": 473,
    "data": [
        {
            "0": "<a href=\"inno\">一諾中學</a>",
            "1": "私立",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"ssgss\">上水官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "北區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"lwfss\">世界龍岡學校劉皇發中學</a>",
            "1": "資助",
            "6": "無",
            "2": "油尖旺",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"chc\">中聖書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "深水埗",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"lws\">中華傳道會劉永生中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "1C"
        },
        {
            "0": "<a href=\"cneccc\">中華傳道會安柱中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "葵青區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"liymss\">中華傳道會李賢堯紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"hftc\">中華基督教會何福堂書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"chuenyuen\">中華基督教會全完中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "葵青區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"cccklc\">中華基督教會公理書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "灣仔區",
            "5": "男女",
            "4": "中中",
            "3": null
        },
        {
            "0": "<a href=\"ccchwc\">中華基督教會協和書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "黃大仙",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"ccckyc\">中華基督教會基元中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"keiheep\">中華基督教會基協中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"keisan\">中華基督教會基新中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "北區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"keichi\">中華基督教會基智中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"keilong\">中華基督教會基朗中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"ccckeito\">中華基督教會基道中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"rotary\">中華基督教會扶輪中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"fywss\">中華基督教會方潤華中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"ccckws\">中華基督教會桂華山中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"yenching\">中華基督教會燕京書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"cccmmwc\">中華基督教會蒙民偉書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "觀塘區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"tllf\">譚李麗芬紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"cccmkc\">中華基督教會銘基書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "油尖旺",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"cccmyc\">中華基督教會銘賢書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "深水埗",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"flk\">馮梁結紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"cymcass\">中華基督教青年會中學</a>",
            "1": "直資",
            "6": "基督教",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "2B"
        },
        {
            "0": "<a href=\"cfss\">中華基金中學</a>",
            "1": "直資",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"lsc\">中華聖潔會靈風中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"ksyss\">九龍三育中學</a>",
            "1": "直資",
            "6": "基督教",
            "2": "油尖旺",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"ktsss\">九龍塘學校</a>",
            "1": "資助",
            "6": "無",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"kts\">九龍工業學校</a>",
            "1": "官立",
            "6": "無",
            "2": "深水埗",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"ktlms\">九龍真光中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "女校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"pentecostal\">五旬節中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"plhks\">五旬節林漢光中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"wingkwong\">五旬節聖潔會永光書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"nyss\">五育中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"szetoho\">五邑司徒浩中學</a>",
            "1": "資助",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"yottkp\">仁愛堂田家炳中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"yotcwsf\">仁愛堂陳黃淑芳紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"ychlpyss\">仁濟醫院林百欣中學</a>",
            "1": "資助",
            "6": "無",
            "2": "荃灣區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"ychwwsss\">仁濟醫院王華湘中學</a>",
            "1": "資助",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"ych2ss\">仁濟醫院第二中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"ychlccsc\">仁濟醫院羅陳楚思中學</a>",
            "1": "資助",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "1C"
        },
        {
            "0": "<a href=\"ychtcy\">仁濟醫院董之英紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"lcp\">仁濟醫院靚次伯紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"qes\">伊利沙伯中學</a>",
            "1": "官立",
            "6": "無",
            "2": "油尖旺",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"ss-qesosa\">伊利沙伯中學舊生會中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"tkwss-qesosa\">湯國華中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"iktmc\">伊斯蘭脫維善紀念中學</a>",
            "1": "資助",
            "6": "回教",
            "2": "東區",
            "5": "男女",
            "4": "英中",
            "3": "2C"
        },
        {
            "0": "<a href=\"bethel\">伯特利中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"hgss\">何文田官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"bhjs\">何明華會督銀禧中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"hotungss\">何東中學</a>",
            "1": "官立",
            "6": "無",
            "2": "灣仔區",
            "5": "女校",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"yckmc\">余振強紀念中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"yck2\">余振強紀念第二中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "南區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"bhnkc\">佛教何南金中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"bstc\">佛教善德英文中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "葵青區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"btkchc\">佛教大光慈航中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"bthc\">佛教大雄中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "深水埗",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"bhscmc\">佛教孔仙洲紀念中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"clbss\">佛教志蓮中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": null
        },
        {
            "0": "<a href=\"waiyan\">佛教慧因法師紀念中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "離島區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"bshlmc\">佛教沈香林紀念中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"bfhmc\">佛教筏可紀念中學</a>",
            "1": "直資",
            "6": "佛教",
            "2": "離島區",
            "5": "男女",
            "4": "英中",
            "3": "3C"
        },
        {
            "0": "<a href=\"bmf\">佛教茂峰法師紀念中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"byknmc\">佛教葉紀南紀念中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"bkkss\">佛教覺光法師中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"bwwtc\">佛教黃允畋中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"bwflc\">佛教黃鳳翎中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "灣仔區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"ppaulvi\">保祿六世書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "葵青區",
            "5": "女校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"plkchc\">保良局何蔭棠中學</a>",
            "1": "資助",
            "6": "無",
            "2": "黃大仙",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"plktnkjsc\">保良局唐乃勤初中書院</a>",
            "1": "資助",
            "6": "無",
            "2": "深水埗",
            "5": "男女",
            "4": "英中",
            "3": "2C"
        },
        {
            "0": "<a href=\"plkylsc\">保良局姚連生中學</a>",
            "1": "資助",
            "6": "無",
            "2": "荃灣區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"plkwyc\">保良局慧妍雅集書院</a>",
            "1": "資助",
            "6": "無",
            "2": "南區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"plkcwc\">保良局朱敬文中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"plklsp\">保良局李城璧中學</a>",
            "1": "資助",
            "6": "無",
            "2": "荃灣區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"plk1984\">保良局甲子何玉清中學</a>",
            "1": "資助",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"plkclscmc\">保良局百周年李兆忠紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"plkno1whc\">保良局第一張永慶中學</a>",
            "1": "資助",
            "6": "無",
            "2": "黃大仙",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"plk83\">保良局羅傑承(一九八三)中學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"plklfc\">保良局羅氏基金中學</a>",
            "1": "直資",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"plkwcc\">保良局胡忠中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"ktchong\">保良局莊啟程預科書院</a>",
            "1": "資助",
            "6": "無",
            "2": "油尖旺",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"plktytc\">保良局董玉娣中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"cky\">保良局蔡繼有學校</a>",
            "1": "私立",
            "6": "無",
            "2": "深水埗",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"npl\">保良局顏寶鈴書院</a>",
            "1": "直資",
            "6": "無",
            "2": "九龍城",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"plkmkmc\">保良局馬錦明中學</a>",
            "1": "資助",
            "6": "無",
            "2": "北區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"plkcfs\">保良局馬錦明夫人章馥仙中學</a>",
            "1": "資助",
            "6": "無",
            "2": "離島區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"gtcollege\">優才楊殷有娣書院</a>",
            "1": "直資",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"ylpss\">元朗公立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "2C"
        },
        {
            "0": "<a href=\"tstss\">鄧兆棠中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"ylmass\">元朗商會中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"ylcss\">元朗天主教中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"wss\">創知中學</a>",
            "1": "直資",
            "6": "無",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"kachi\">加拿大神召會嘉智中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"clsnp\">北角協同中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "灣仔區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"ucc\">匯基書院</a>",
            "1": "按位津貼",
            "6": "基督教",
            "2": "深水埗",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"uccke\">匯基書院東九龍</a>",
            "1": "直資",
            "6": "基督教",
            "2": "觀塘區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"sphrc\">十八鄉鄉事委員會公益社中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"hys\">協恩中學</a>",
            "1": "直資",
            "6": "基督教",
            "2": "九龍城",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"ilc\">南亞路德會沐恩中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "大埔區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"stmgss\">南屯門官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "英中",
            "3": "2A"
        },
        {
            "0": "<a href=\"pohtyh\">鄧英喜中學</a>",
            "1": "資助",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"lstc\">梁省德中學</a>",
            "1": "資助",
            "6": "無",
            "2": "荃灣區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"tpk\">博愛醫院鄧佩瓊紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"pohck\">博愛醫院陳楷紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"holap\">可立中學</a>",
            "1": "資助",
            "6": "儒釋道",
            "2": "黃大仙",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"hodao\">可道中學</a>",
            "1": "資助",
            "6": "儒釋道",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"hofung\">可風中學</a>",
            "1": "資助",
            "6": "儒釋道",
            "2": "荃灣區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"tsac\">台山商會中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"renaissance\">啓新書院</a>",
            "1": "私立",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"css\">啟思中學</a>",
            "1": "直資",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"lasalle\">喇沙書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "九龍城",
            "5": "男校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"hongai\">可藝中學</a>",
            "1": "資助",
            "6": "儒釋道",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"hoyu\">可譽中學</a>",
            "1": "資助",
            "6": "儒釋道",
            "2": "離島區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"ptcc\">嘉諾撒培德書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "南區",
            "5": "女校",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"canossa\">嘉諾撒書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "東區",
            "5": "女校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"hfcc\">嘉諾撒聖家書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "九龍城",
            "5": "女校",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"shcc\">嘉諾撒聖心書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "南區",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"sfcc\">嘉諾撒聖方濟各書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "灣仔區",
            "5": "女校",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"smcc-canossian\">嘉諾撒聖瑪利書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "油尖旺",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"icqm\">國際基督教優質音樂中學暨小學</a>",
            "1": "私立",
            "6": "基督教",
            "2": "黃大仙",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"mfbmclct\">陳呂重德紀念中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"deliahw\">地利亞修女紀念學校(協和)</a>",
            "1": "直資",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "英中",
            "3": "3A"
        },
        {
            "0": "<a href=\"mrck\">地利亞修女紀念學校(協和二中)</a>",
            "1": "直資",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"dmsgp\">地利亞修女紀念學校(吉利徑)</a>",
            "1": "直資",
            "6": "無",
            "2": "深水埗",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"dmsyw\">地利亞修女紀念學校(月華)</a>",
            "1": "直資",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"deliabw\">地利亞修女紀念學校(百老匯)</a>",
            "1": "直資",
            "6": "無",
            "2": "深水埗",
            "5": "男女",
            "4": "英中",
            "3": "2C"
        },
        {
            "0": "<a href=\"pkms\">培僑中學</a>",
            "1": "直資",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"puikiucollege\">培僑書院</a>",
            "1": "直資",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"puiying\">培英中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "南區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"stcc\">聖道迦南書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "觀塘區",
            "5": "男女",
            "4": "英中",
            "3": "2A"
        },
        {
            "0": "<a href=\"htyc\">基督教女青年會丘佐榮中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"skss\">基督教宣道會宣基中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "西貢區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"ttca\">基督教崇真中學</a>",
            "1": "直資",
            "6": "基督教",
            "2": "深水埗",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"holmglad\">基督教聖約教會堅樂中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"lss\">基督教香港信義會信義中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "油尖旺",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"yll\">元朗信義中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"luac\">宏信書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "3A"
        },
        {
            "0": "<a href=\"flss\">基督教香港信義會心誠中學</a>",
            "1": "直資",
            "6": "基督教",
            "2": "北區",
            "5": "男女",
            "4": "英中",
            "3": "2B"
        },
        {
            "0": "<a href=\"christcollege\">基督書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"tkhc\">大光德萃書院</a>",
            "1": "私立",
            "6": "無",
            "2": "大埔區",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"tpsy\">大埔三育中學</a>",
            "1": "直資",
            "6": "基督教",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"tpgss\">大埔官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"ngwahsec\">天主教伍華中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"nwcss\">天主教南華中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "深水埗",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"puishing\">天主教培聖中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"stc\">天主教崇德英文書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"sdbnsm\">天主教慈幼會伍少梅中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "葵青區",
            "5": "男校",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"newman\">天主教新民書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "油尖旺",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"pochiu\">天主教普照中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"dmhcsm\">天主教母佑會蕭明中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "葵青區",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"ktscss\">天主教郭得勝中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"mingyuen\">天主教鳴遠中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"tswgss\">天水圍官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"tswmc\">天水圍循道衞理中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"tsw-heungto\">天水圍香島中學</a>",
            "1": "直資",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"lkl\">妙法寺劉金龍中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "屯門區",
            "5": "女校",
            "4": "英中",
            "3": "2B"
        },
        {
            "0": "<a href=\"cpc\">張沛松紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"chkpcc\">孔教學院大成何郭佩珍中學</a>",
            "1": "資助",
            "6": "孔教",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"chms\">孔聖堂中學</a>",
            "1": "直資",
            "6": "無",
            "2": "灣仔區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"seksswk\">官立嘉道理爵士中學</a>",
            "1": "官立",
            "6": "無",
            "2": "油尖旺",
            "5": "男女",
            "4": "英中",
            "3": "3B"
        },
        {
            "0": "<a href=\"cactm\">宣道中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"caswcmc\">宣道會陳朱素華紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "北區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"npc\">寧波公學</a>",
            "1": "資助",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"np2c\">寧波第二中學</a>",
            "1": "資助",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"pocawsc\">王少清中學</a>",
            "1": "資助",
            "6": "無",
            "2": "荃灣區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"pbss\">寶血女子中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "東區",
            "5": "女校",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"htc\">寶血會上智英文書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "深水埗",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"pokok\">寶覺中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"tkogss\">將軍澳官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"tko-heungto\">將軍澳香島中學</a>",
            "1": "直資",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"tmcss\">屯門天主教中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "屯門區",
            "5": "男女",
            "4": "英中",
            "3": "2A"
        },
        {
            "0": "<a href=\"tmgss\">屯門官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "英中",
            "3": "2A"
        },
        {
            "0": "<a href=\"ttms\">崇正中學</a>",
            "1": "私立",
            "6": "無",
            "2": "深水埗",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"ttc\">崇真書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"lingnan\">嶺南中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"lhymss\">嶺南衡怡紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"ldcwkmss\">嶺南鍾榮光博士紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"belilios\">庇理羅士女子中學</a>",
            "1": "官立",
            "6": "無",
            "2": "東區",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"lpsmc\">廖寶珊紀念書院</a>",
            "1": "資助",
            "6": "無",
            "2": "荃灣區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"cmass\">廠商會中學</a>",
            "1": "資助",
            "6": "無",
            "2": "深水埗",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"cmacck\">廠商會蔡章閣中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"isf\">弘立書院</a>",
            "1": "私立",
            "6": "無",
            "2": "南區",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"cghc\">張振興伉儷書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"ccsc\">張祝珊英文中學</a>",
            "1": "資助",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"choihung\">彩虹邨天主教英文中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "黃大仙",
            "5": "男校",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"mckln\">循道中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "油尖旺",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"lwlc\">李惠利中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"tsss\">德信中學</a>",
            "1": "直資",
            "6": "天主教",
            "2": "沙田區",
            "5": "男校",
            "4": "英中",
            "3": "2C"
        },
        {
            "0": "<a href=\"takoi\">德愛中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "黃大仙",
            "5": "女校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"ghs\">德望學校</a>",
            "1": "直資",
            "6": "天主教",
            "2": "黃大仙",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"stteresa\">德蘭中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "九龍城",
            "5": "女校",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"tackching\">德貞女子中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "深水埗",
            "5": "女校",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"taknga\">德雅中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "深水埗",
            "5": "女校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"valtorta\">恩主教書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "大埔區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"ypicallmc\">恩平工商會李琳明中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"wkc\">惠僑英文中學</a>",
            "1": "直資",
            "6": "無",
            "2": "深水埗",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"ssshk\">慈幼英文學校</a>",
            "1": "資助",
            "6": "天主教",
            "2": "東區",
            "5": "男校",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"mukuang\">慕光英文書院</a>",
            "1": "直資",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"dgs\">拔萃女書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "油尖旺",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"dbs\">拔萃男書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "九龍城",
            "5": "男校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"evangel\">播道書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "西貢區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"wbss\">救世軍卜維廉中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"kyc\">救恩書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"cckln\">九龍文理書院</a>",
            "1": "資助",
            "6": "無",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"cognitiohk\">香港文理書院</a>",
            "1": "資助",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"nams\">新亞中學</a>",
            "1": "資助",
            "6": "無",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"swcs\">新會商會中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"cpss\">新會商會陳白沙紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "南區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"lkpfc\">呂郭碧鳳中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "觀塘區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"nlsipess\">新生命教育協會平安福音中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"delasalle\">新界喇沙中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "北區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"cccss\">新界西貢坑口區鄭植之中學</a>",
            "1": "資助",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"nthykyldss\">新界鄉議局元朗區中學</a>",
            "1": "官立",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"nthyktpdss\">新界鄉議局大埔區中學</a>",
            "1": "官立",
            "6": "無",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"hpccss\">旅港開平商會中學</a>",
            "1": "資助",
            "6": "無",
            "2": "九龍城",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"cys\">明愛元朗陳震夏中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"tmmarden\">明愛屯門馬登基金中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"ccm\">明愛柴灣馬登基金中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"cfs\">明愛粉嶺陳震夏中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "北區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"csjss\">明愛聖若瑟中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"cwcc\">明愛胡振中中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "南區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"ccym\">明愛莊月明中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "南區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"ccvc\">明愛華德中書院</a>",
            "1": "直資",
            "6": "天主教",
            "2": "離島區",
            "5": "男女",
            "4": "中中",
            "3": null
        },
        {
            "0": "<a href=\"cmos\">明愛馬鞍山中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"kingling\">景嶺書院</a>",
            "1": "資助",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"discovery\">智新書院</a>",
            "1": "私立",
            "6": "無",
            "2": "離島區",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"tpsss\">曾璧山(崇蘭)中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"lkyms\">李求恩紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"tccs\">東涌天主教學校</a>",
            "1": "資助",
            "6": "天主教",
            "2": "離島區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"lplss\">東莞工商總會劉百樂中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"twghwyyms\">東華三院伍若瑜夫人紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"twghscgms\">東華三院吳祥川紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "英中",
            "3": "2A"
        },
        {
            "0": "<a href=\"lycmc\">東華三院呂潤財紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"twghcmts\">東華三院張明添中學</a>",
            "1": "資助",
            "6": "無",
            "2": "深水埗",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"twghlkss\">東華三院李嘉誠中學</a>",
            "1": "資助",
            "6": "無",
            "2": "北區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"lcdmc\">東華三院李潤田紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "灣仔區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"twghkyds\">東華三院甲寅年總理中學</a>",
            "1": "資助",
            "6": "無",
            "2": "北區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"lktmc\">東華三院盧幹庭紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"shd\">東華三院辛亥年總理中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"ytt\">東華三院邱子田紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"twyky\">東華三院邱金元中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"twghkywc\">東華三院郭一葦中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"twghsksk\">東華三院鄺錫坤伉儷中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": null
        },
        {
            "0": "<a href=\"twghczm\">東華三院陳兆民中學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"cyma\">東華三院馬振玉紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"twghfwfts\">東華三院馮黃鳳亭中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"twghwfns\">東華三院黃笏南中學</a>",
            "1": "資助",
            "6": "無",
            "2": "九龍城",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"twghwflc\">東華三院黃鳳翎中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"ltfc\">林大輝中學</a>",
            "1": "直資",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "2C"
        },
        {
            "0": "<a href=\"austin\">柯士甸學校</a>",
            "1": "私立",
            "6": "無",
            "2": "油尖旺",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"lscc\">梁式芝書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "觀塘區",
            "5": "女校",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"hlmssst\">梁文燕紀念中學(沙田)</a>",
            "1": "官立",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"csa\">棉紡會中學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"ykh\">樂善堂余近卿中學</a>",
            "1": "資助",
            "6": "無",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"lstlcw\">樂善堂梁植偉紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"lstlkkc\">樂善堂梁銶琚書院</a>",
            "1": "資助",
            "6": "無",
            "2": "中西區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"lstyoungkhl\">樂善堂楊葛小琳中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"lstwcm\">樂善堂王仲銘中學</a>",
            "1": "資助",
            "6": "無",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"lstkcmss\">樂善堂顧超文中學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"locktao\">樂道中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"munsang\">民生書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"pyc\">沙田培英中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"stgss\">沙田官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"sttss\">沙田崇真中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"stmc\">沙田循道衞理中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"kcc-st\">沙田蘇浙公學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"blmcss\">浸信會呂明才中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"bwlss\">浸信會永隆中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"semple\">深培中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"ccpass\">港九潮州公會中學</a>",
            "1": "資助",
            "6": "無",
            "2": "油尖旺",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"mcsss\">港九潮州公會馬松深中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"sunfc\">港九街坊婦女會孫方中書院</a>",
            "1": "資助",
            "6": "無",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"hkugac\">港大同學會書院</a>",
            "1": "直資",
            "6": "無",
            "2": "南區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"imsc\">港島民生書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "東區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"qmss\">港澳信義會慕德中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"ymcacc\">港青基信書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "離島區",
            "5": "男女",
            "4": "英中",
            "3": "2B"
        },
        {
            "0": "<a href=\"vsa\">滬江維多利亞學校</a>",
            "1": "私立",
            "6": "無",
            "2": "南區",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"honwah\">漢華中學</a>",
            "1": "直資",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"han\">漢鼎書院</a>",
            "1": "私立",
            "6": "無",
            "2": "南區",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"kitsam\">潔心林炳炎中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "黃大仙",
            "5": "女校",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"ccass\">潮州會館中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"fhms\">炮台山循道衞理中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": null
        },
        {
            "0": "<a href=\"lionscollege\">獅子會中學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"notre-dame-college\">獻主會聖母院書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"wscss\">王肇枝中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "大埔區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"rhs\">玫瑰崗中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "灣仔區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"mss\">瑪利曼中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "灣仔區",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"mssch\">瑪利諾中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"mcs\">瑪利諾修院學校</a>",
            "1": "資助",
            "6": "天主教",
            "2": "九龍城",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"mfs\">瑪利諾神父教會學校</a>",
            "1": "資助",
            "6": "天主教",
            "2": "深水埗",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"tkpss\">田家炳中學</a>",
            "1": "資助",
            "6": "無",
            "2": "北區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"qc\">皇仁書院</a>",
            "1": "官立",
            "6": "無",
            "2": "灣仔區",
            "5": "男校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"qcobass\">皇仁舊生會中學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"tlgc\">真光女書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "油尖旺",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"slc\">石籬天主教中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"shema\">示昕學校</a>",
            "1": "私立",
            "6": "基督教",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": null
        },
        {
            "0": "<a href=\"hebron\">神召會康樂中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"aogmms\">神召會德萃書院</a>",
            "1": "私立",
            "6": "基督教",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": null
        },
        {
            "0": "<a href=\"fukien\">福建中學</a>",
            "1": "直資",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"fss\">福建中學小西灣</a>",
            "1": "資助",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"rhenishcollege\">禮賢會彭學高紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"sgss\">筲箕灣官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"sescampus\">筲箕灣東官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"fgss\">粉嶺官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "北區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"fkyc\">粉嶺救恩書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "北區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"frcss\">粉嶺禮賢會中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "北區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"tiaccwhf\">胡漢輝中學</a>",
            "1": "資助",
            "6": "無",
            "2": "荃灣區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"ltpss\">羅定邦中學</a>",
            "1": "直資",
            "6": "無",
            "2": "大埔區",
            "5": "男女",
            "4": "英中",
            "3": "2A"
        },
        {
            "0": "<a href=\"stpeter\">聖伯多祿中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "南區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"spss\">聖保祿中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "灣仔區",
            "5": "女校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"spcs\">聖保祿學校</a>",
            "1": "直資",
            "6": "天主教",
            "2": "灣仔區",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"spc\">聖保羅書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "中西區",
            "5": "男校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"spcc\">聖保羅男女中學</a>",
            "1": "直資",
            "6": "基督教",
            "2": "中西區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"scsg\">聖傑靈女子中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "觀塘區",
            "5": "女校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"skhlmc\">聖公會呂明才中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "南區",
            "5": "男女",
            "4": "英中",
            "3": "2A"
        },
        {
            "0": "<a href=\"keihau\">聖公會基孝中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"skhtst\">聖公會曾肇添中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"liping\">聖公會李炳中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "荃灣區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"lfh\">聖公會李福慶中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"skhlkmss\">聖公會林裘謀中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"lamwoo\">聖公會林護紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "葵青區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"skhlkyss\">聖公會梁季彜中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"skhbbss\">聖公會白約翰會督中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"skhhtcss\">聖公會聖三一堂中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"hcs\">聖公會聖匠中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"skhsbs\">聖公會聖本德中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"skhsslmc\">聖公會聖西門呂明才中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"smcc\">莫慶堯中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "深水埗",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"mst\">聖公會莫壽增會督中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "大埔區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"tkp\">聖公會蔡功譜中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"skhasms\">聖公會諸聖中學</a>",
            "1": "按位津貼",
            "6": "基督教",
            "2": "油尖旺",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"tsk\">聖公會鄧肇堅中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "灣仔區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"skhcyss\">聖公會陳融中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "北區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"stclare\">聖嘉勒女書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "中西區",
            "5": "女校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"sscc\">聖士提反堂中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "中西區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"ssgc\">聖士提反女子中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "中西區",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"ssc\">聖士提反書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "南區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"sagc\">聖安當女書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "觀塘區",
            "5": "女校",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"sbc\">聖文德書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"olc\">聖母書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "黃大仙",
            "5": "女校",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"ihmc\">聖母無玷聖心書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"olr\">聖母玫瑰書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "深水埗",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"smcesps\">聖瑪加利男女英文中小學</a>",
            "1": "直資",
            "6": "天主教",
            "2": "深水埗",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"hksrl\">聖羅撒書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "沙田區",
            "5": "女校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"sfac\">聖芳濟各書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "北區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"sfxc\">聖芳濟書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "油尖旺",
            "5": "男校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"sjc\">聖若瑟書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "中西區",
            "5": "男校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"sjacs\">聖若瑟英文中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "觀塘區",
            "5": "男校",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"singyin\">聖言中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "觀塘區",
            "5": "男校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"sja\">聖貞德中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"stlouis\">聖類斯中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "中西區",
            "5": "男校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"stmarks\">聖馬可中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "東區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"kings\">英皇書院</a>",
            "1": "官立",
            "6": "無",
            "2": "中西區",
            "5": "男校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"ywgs\">英華女學校</a>",
            "1": "資助",
            "6": "基督教",
            "2": "中西區",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"yingwa\">英華書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "深水埗",
            "5": "男校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"invictus\">茵維特中學</a>",
            "1": "私立",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"twphcymc\">何傳耀紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "荃灣區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"twgss\">荃灣官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "荃灣區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"sfxs\">荃灣聖芳濟中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "荃灣區",
            "5": "男校",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"lkcss\">荔景天主教中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"wyk\">華仁書院(九龍)</a>",
            "1": "資助",
            "6": "天主教",
            "2": "油尖旺",
            "5": "男校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"waying\">華英中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"pakkau\">萬鈞伯裘書院</a>",
            "1": "直資",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"qualiedcollege\">萬鈞匯知中學</a>",
            "1": "直資",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"kcmc\">葵涌循道中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"kcckc\">葵涌蘇浙公學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"spslt\">藍田聖保祿中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "觀塘區",
            "5": "女校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"kccnpweb\">蘇浙公學</a>",
            "1": "直資",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"mcw\">衞理中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "1C"
        },
        {
            "0": "<a href=\"jccssyl\">元朗裘錦秋中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"jcctm\">屯門裘錦秋中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"jcckc\">葵涌裘錦秋中學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"sts\">西貢崇真天主教學校</a>",
            "1": "資助",
            "6": "天主教",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"ktklgss\">觀塘功樂官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "觀塘區",
            "5": "男校",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"ktgss\">觀塘官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"ktmc\">觀塘瑪利諾書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "觀塘區",
            "5": "男校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"jcgss\">賽馬會官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"tjcec\">賽馬會萬鈞毅智書院</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"tic\">賽馬會體藝中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"clsmss\">趙聿修紀念中學</a>",
            "1": "官立",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"cls\">路德會協同中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "深水埗",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"llc\">路德會呂明才中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "荃灣區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"lck\">路德會呂祥光中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"ktlc\">路德會官塘書院</a>",
            "1": "私立",
            "6": "基督教",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": null
        },
        {
            "0": "<a href=\"home-gslc\">路德會西門英才中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"carmelss\">迦密中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"cdgfss\">迦密主恩中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "西貢區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"cbt\">迦密唐賓南紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"calfss\">迦密愛禮信中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"cpu\">迦密柏雨中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "大埔區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"chw\">迦密聖道中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"tskvgss\">鄧肇堅維多利亞官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "灣仔區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"tangkingpo\">鄧鏡波學校</a>",
            "1": "資助",
            "6": "天主教",
            "2": "九龍城",
            "5": "男校",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"shwss\">釋慧文中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"cpcydss\">金巴崙長老會耀道中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"clementi\">金文泰中學</a>",
            "1": "官立",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"csbs\">鐘聲慈善社胡陳金枝中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"cswcss\">長沙灣天主教英文中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "深水埗",
            "5": "男校",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"ccgss\">長洲官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "離島區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"mkc\">閩僑中學</a>",
            "1": "資助",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"cskms\">陳樹渠紀念中學</a>",
            "1": "直資",
            "6": "無",
            "2": "深水埗",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"csklsc\">陳瑞祺喇沙書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "九龍城",
            "5": "男校",
            "4": "英中",
            "3": "2A"
        },
        {
            "0": "<a href=\"llcmhlau\">靈糧堂劉梅軒中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"llcew\">靈糧堂怡文中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "離島區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"ymca-coll\">青年會書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"cchpwss\">青松侯寶垣中學</a>",
            "1": "資助",
            "6": "道教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"slcss\">順利天主教中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "觀塘區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"lskc\">順德聯誼總會李兆基中學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"lkkc\">順德聯誼總會梁銶琚中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"stfa-yyc\">順德聯誼總會翁祐中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"stfaswc\">順德聯誼總會胡兆熾中學</a>",
            "1": "資助",
            "6": "無",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"tpyc\">順德聯誼總會譚伯羽中學</a>",
            "1": "資助",
            "6": "無",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "1B"
        },
        {
            "0": "<a href=\"cytss\">順德聯誼總會鄭裕彤中學</a>",
            "1": "資助",
            "6": "無",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"henrietta\">顯理中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "東區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"elegantia\">風采中學</a>",
            "1": "資助",
            "6": "無",
            "2": "北區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"heungto\">香島中學</a>",
            "1": "直資",
            "6": "無",
            "2": "深水埗",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"iwshk\">香島華德福學校</a>",
            "1": "私立",
            "6": "無",
            "2": "中西區",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"blcwc\">香海正覺蓮社佛教梁植偉中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "屯門區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"bckss\">香海正覺蓮社佛教正覺中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"bmkc\">馬錦燦紀念英文中學</a>",
            "1": "資助",
            "6": "佛教",
            "2": "北區",
            "5": "男女",
            "4": "英中",
            "3": "2B"
        },
        {
            "0": "<a href=\"hkcwcc\">香港中國婦女會中學</a>",
            "1": "資助",
            "6": "無",
            "2": "東區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"fyk\">馮堯敬紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"tcss\">張煊昌中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"cch\">陳震夏中學</a>",
            "1": "資助",
            "6": "無",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"cwgc\">宣道會鄭榮之中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"scc\">宣道會陳瑞芝紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"ats\">香港仔工業學校</a>",
            "1": "資助",
            "6": "天主教",
            "2": "南區",
            "5": "男校",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"ablmcc\">香港仔浸信會呂明才書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "南區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"creativehk\">香港兆基創意書院</a>",
            "1": "直資",
            "6": "無",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": null
        },
        {
            "0": "<a href=\"cnc\">陳南昌紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"wtsmc\">黃棣珊紀念中學</a>",
            "1": "資助",
            "6": "無",
            "2": "深水埗",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"puiching\">香港培正中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "男女",
            "4": "中中",
            "3": "1A"
        },
        {
            "0": "<a href=\"pooito\">香港培道中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "九龍城",
            "5": "女校",
            "4": "中中",
            "3": "1B"
        },
        {
            "0": "<a href=\"malvern\">香港墨爾文國際學校</a>",
            "1": "私立",
            "6": "無",
            "2": "大埔區",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"hkwmacsl\">香港布廠商會朱石麟中學</a>",
            "1": "資助",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"hkaa\">香港復臨學校</a>",
            "1": "私立",
            "6": "基督教",
            "2": "西貢區",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"hktalhk\">香港教師會李興貴中學</a>",
            "1": "資助",
            "6": "無",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"wcbss\">黃楚標中學</a>",
            "1": "資助",
            "6": "無",
            "2": "離島區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"hkbuas\">王錦輝中小學</a>",
            "1": "直資",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"tlmshk\">香港真光中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "灣仔區",
            "5": "女校",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"hktlc\">香港真光書院</a>",
            "1": "資助",
            "6": "基督教",
            "2": "南區",
            "5": "女校",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"spkc\">香港神託會培基書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"pooitun\">香港神託會培敦中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"hkmadavidli\">李國寶中學</a>",
            "1": "直資",
            "6": "無",
            "2": "油尖旺",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"hkmakslo\">香港管理專業協會羅桂祥中學</a>",
            "1": "資助",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "1C"
        },
        {
            "0": "<a href=\"hkrsstpss\">香港紅卍字會大埔卍慈中學</a>",
            "1": "資助",
            "6": "無",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"hkbc\">香港紫荊書院</a>",
            "1": "私立",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "英中",
            "3": null
        },
        {
            "0": "<a href=\"bhss\">香港聖公會何明華會督中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"smgchk\">香港聖瑪加利女書院</a>",
            "1": "直資",
            "6": "天主教",
            "2": "沙田區",
            "5": "女校",
            "4": "英中",
            "3": "3B"
        },
        {
            "0": "<a href=\"hkss\">香港航海學校</a>",
            "1": "資助",
            "6": "無",
            "2": "南區",
            "5": "男校",
            "4": "中中",
            "3": "3C"
        },
        {
            "0": "<a href=\"logosacademy\">真道書院</a>",
            "1": "直資",
            "6": "基督教",
            "2": "西貢區",
            "5": "男女",
            "4": "英中",
            "3": "2A"
        },
        {
            "0": "<a href=\"wahyan\">香港華仁書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "灣仔區",
            "5": "男校",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"rsefhkmaria\">瑪利亞書院</a>",
            "1": "私立",
            "6": "無",
            "2": "油尖旺",
            "5": "男女",
            "4": "中中",
            "3": null
        },
        {
            "0": "<a href=\"yy1\">圓玄學院第一中學</a>",
            "1": "資助",
            "6": "道教",
            "2": "葵青區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"hktayy3\">圓玄學院第三中學</a>",
            "1": "資助",
            "6": "道教",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"yy2\">圓玄學院第二中學</a>",
            "1": "資助",
            "6": "道教",
            "2": "大埔區",
            "5": "男女",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"tanghin\">鄧顯紀念中學</a>",
            "1": "資助",
            "6": "道教",
            "2": "北區",
            "5": "男女",
            "4": "英中",
            "3": "1A"
        },
        {
            "0": "<a href=\"ccss\">香港道教聯合會青松中學</a>",
            "1": "資助",
            "6": "道教",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"hktkpc\">香港鄧鏡波書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "灣仔區",
            "5": "男校",
            "4": "中中",
            "3": "2B"
        },
        {
            "0": "<a href=\"hlc\">香港青年協會李兆基書院</a>",
            "1": "直資",
            "6": "無",
            "2": "元朗區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"makopan\">馬可賓紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "屯門區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"mcdhmc\">馬陳端喜紀念中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "西貢區",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        },
        {
            "0": "<a href=\"mosttss\">馬鞍山崇真中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"mossjss\">馬鞍山聖若瑟中學</a>",
            "1": "資助",
            "6": "天主教",
            "2": "沙田區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"raimondi\">高主教書院</a>",
            "1": "資助",
            "6": "天主教",
            "2": "中西區",
            "5": "男女",
            "4": "英中",
            "3": "1B"
        },
        {
            "0": "<a href=\"klss\">高雷中學</a>",
            "1": "資助",
            "6": "無",
            "2": "觀塘區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"fklmstss\">鳳溪廖萬石堂中學</a>",
            "1": "資助",
            "6": "無",
            "2": "北區",
            "5": "男女",
            "4": "中中",
            "3": "2A"
        },
        {
            "0": "<a href=\"fk1ss-fungkai\">鳳溪第一中學</a>",
            "1": "資助",
            "6": "無",
            "2": "北區",
            "5": "男女",
            "4": "中中",
            "3": "2C"
        },
        {
            "0": "<a href=\"laichack\">麗澤中學</a>",
            "1": "資助",
            "6": "基督教",
            "2": "油尖旺",
            "5": "男女",
            "4": "中中",
            "3": "3A"
        },
        {
            "0": "<a href=\"lcgss\">龍翔官立中學</a>",
            "1": "官立",
            "6": "無",
            "2": "黃大仙",
            "5": "男女",
            "4": "中中",
            "3": "3B"
        }
    ]
};

const sReg = /(?<=\>).*?(?=\<)/i;

async function insertData() {
    const newData = data['data'].map((item) => {
        const newItem = {
            name: item['0'].match(sReg)[0],
            type: item['1']?item['1']:'None',
            district: item['2']?item['2']:'None',
            banding: item['3']?item['3']:'None',
            lang: item['4']?item['4']:'None',
            sex: item['5']?item['5']:'None',
            religion: item['6']?item['6']:'None'
        }
        return newItem;
    });
    await hongkongMiddleSchoolModel.insertMany(newData);
}

async function main() {
    try {
        await insertData();
        process.exit(0);
    } catch (e) {
        logger.error(`Error: ${e}`);
        process.exit(1);
    }
}

main();

